{
	"name": "LifeProduct",
	"properties": {
		"Name": "LifeProduct",
		"EntityType": "TABLE",
		"Namespace": {
			"DatabaseName": "Database1"
		},
		"Description": "A product is anything that can be offered to a market that might satisfy a want or need by potential customers.    That product is the sum of all physical, psychological, symbolic, and service attributes associated with it.\n\nThere are two basic types of products:\n\n- Tangible (physical)\n- Intangible (non-physical) such as services\n\nA service is a non-material or intangible product - such as professional consultancy, maintenance service, repair service etc.\nEach product has its own benefits, application, brand name, and packaging that gives it its own identity and distinguishing characteristics.\n\nEvery business or organization has business rules that define precisely what a product is.    While we intuitively know what a product is, we must quantify that knowledge and associated business rules with consistent definitions that can be implemented within the organization in strategies and applications.\n\nA product typically goes through five stages of development:\n\n(1) Idea Stage - involving a thorough evaluation of the potential product\n\n(2) Concept Stage - determines customer acceptance by testing and presentation to consumers and distribution channel members.   Specific aspects regarding quality, dependability, reliability, warranty, packaging, service, pricing, terms of sale, sales and distribution channels, advertising and promotions are evaluated.\n\n(3) Product Development Stage - transforms the prototype product into an actual product for mass sale.   This stage requires close interaction between both marketing and manufacturing.\n\n(4) Test Marketing Stage - may or may not be used since it is an expensive and time-consuming process.  Test marketing involves evaluating various product options and alternatives.\n\n(5) Commercialization - It is very expensive to launch a new product so commercialization only applies to those specific products that are actually going to be sold to the market.\n\nProducts tend to be categorized as either:  Industrial goods and consumer goods\n\nIndustrial goods are used to produce other products .\n\nIndustrial goods may be further divided into:\n\n- Raw materials\n- Equipment\n- Pre-built materials \n- Supplies.\n\nConsumer goods are intended for consumption by the general public.\n\nConsumer goods may be further divided into:\n\n- Durable goods\n- Nondurable goods\n- Packaged goods\n\nA product may be a member of a product family or product line.\n\nA product family is a grouping of products or services that are related to each other by common function, functionality, design platform or similar characteristics.\n\nMembers of a product family frequently have many common parts and assemblies.\n\nProduct families are the highest level of grouping for forecasting, capacity planning or related functions.\n\nEx:\nThe Apple Macintosh family of products consists of the product lines:\n- Mac mini\n- MacBook Pro\n- Mac Pro\n\nA product line is a grouping of products that are closely related in usage, functionality or marketing characteristics.\n\nA Product Family typically is created to address one or five functions:\n\n1. To increase profits and not erode the sales of existing products\n\n2. To attract additional Markets or Market Segments\n\n3. To counter competitor's products\n\n4. To fill a gap in an existing Product Family.\n\n5. To promote sales of other products in the family line\n\nLine Depth refers to the number of products in the product line.\n\nLine consistency refers to how closely related the products are that make up the product line.\n\nLine vulnerability refers to the percentage of sales or profits that are derived from only a few products in the product line.\n\nProduct width refers to the number of different product lines sold by a company.\n\nProduct mix refers to the total number of products sold in all product lines.\n\nLine extension refers to the adding of a new product to a line.\n\n\"Trading up or brand leveraging\" refers to adding a product of better quality to a product line than the other products in that line.\n\n\"Trading down\" refers to adding a product of lesser quality to a product line than the other products in that line.\n\nIf a line of products is sold with the same brand name, this is referred to as family branding.\nStrategy and decisions regarding a product line are usually incorporated in a high-level marketing plan addressing product line strategy, sales, channels, distribution channels, pricing and related issues.\nA product-line manager is responsible for a product line and supervises several product managers who are responsible for individual products within the line.\nProduct-line managers typically have the following responsibilities:\n- Expansion and composition of a product line\n- Evaluate the effects of product mixes on the profitability of other items in the line\n- Planning and allocation of resources to individual products in the line\nA product is normally associated with a brand strategy - manufacturer, private or generic.\n\n1. Manufacturer-  or 'national' branding in which the brand is assigned by the manufacturer of the Product.\n\n2. Private - or 'dealer' branding in which the brand is assigned by the retailer or wholesaler of the Product.\n\n3. Generic - in which the Product is not marked with any identification.   Generic brands are a means for manufacturers to increase profits by saving on advertising, packaging or other costs associated with manufacturer or private branding.\n\nA brand is name, term, sign, symbol or design or a combination of these which identify the goods or services and differentiate them from those of competitors'\n\nA Trade mark is a brand or some part of the brand that is given legal protection because it is capable of exclusive appropriation and representation.\n\nManufacturers can use their own brands (known as Manufacturers' brands) or brands of their distributors (Distributors' brands).\n\nManufacturers/ distributors use brand names for a variety of reasons ranging from simple identification purposes to having legal protection for unique features of the products from imitations.\n\nBrands help consumers recognize certain quality parameters. In some cases, brands are just used to endow the product with unique story and character which itself can be a basis for product differentiation.\n\nIndividual brands have their own identity and the corporate or common name is not used to promote its equity.\n\nIndividual branding requires more expensive advertising and brand extensive brand creation investments.  By extension, each new brand does not benefit from the positive perceptions of earlier brands.\n\nBy contrast, family branding has several advantages.\n\nEach new product is quickly associated with the other products and brand in terms of quality and benefits.\n\nReduced or eliminated time for name identification and advertising for name recognition purposes.",
		"TableType": "EXTERNAL",
		"Origin": {
			"Type": "SPARK"
		},
		"StorageDescriptor": {
			"Columns": [
				{
					"Name": "ProductId",
					"Description": "The unique identifier of a Product.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ProductId"
					},
					"OriginDataTypeName": {
						"TypeName": "long",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "long"
						}
					}
				},
				{
					"Name": "ProductName",
					"Description": "The name of the Product, which normally corresponds to the 'marketing name' of the Product.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ProductName"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 128,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "ProductDescription",
					"Description": "The description of the Product.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ProductDescription"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 512,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "MinimumFaceValueAmount",
					"Description": "The minimum face value offerable by the Insurance Product.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "MinimumFaceValueAmount"
					},
					"OriginDataTypeName": {
						"TypeName": "decimal",
						"IsComplexType": false,
						"IsNullable": true,
						"Precision": 18,
						"Scale": 2,
						"Properties": {
							"HIVE_TYPE_STRING": "decimal"
						}
					}
				},
				{
					"Name": "MaximumFaceValueAmount",
					"Description": "The maximum face value offerable by the Insurance Product.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "MaximumFaceValueAmount"
					},
					"OriginDataTypeName": {
						"TypeName": "decimal",
						"IsComplexType": false,
						"IsNullable": true,
						"Precision": 18,
						"Scale": 2,
						"Properties": {
							"HIVE_TYPE_STRING": "decimal"
						}
					}
				},
				{
					"Name": "MaximumAllowableLoanRate",
					"Description": "The maximum allowable interest rate of policy loans associated with the Insurance Product.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "MaximumAllowableLoanRate"
					},
					"OriginDataTypeName": {
						"TypeName": "decimal",
						"IsComplexType": false,
						"IsNullable": true,
						"Precision": 18,
						"Scale": 8,
						"Properties": {
							"HIVE_TYPE_STRING": "decimal"
						}
					}
				},
				{
					"Name": "GracePeriod",
					"Description": "A period from the premium due date during which an insurance contract remains in force and the premiums may be paid.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "GracePeriod"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "ReinstatementPeriod",
					"Description": "The number of days after lapse of the insurance policy that the insurance policy may be reinstated upon payment of past premiums, interest and evidence of continued insurability.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ReinstatementPeriod"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "StandardPremium",
					"Description": "The baseline or 'standard' premium against which risks and assessment are added to determine the actual premium.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "StandardPremium"
					},
					"OriginDataTypeName": {
						"TypeName": "decimal",
						"IsComplexType": false,
						"IsNullable": true,
						"Precision": 18,
						"Scale": 2,
						"Properties": {
							"HIVE_TYPE_STRING": "decimal"
						}
					}
				},
				{
					"Name": "SuicideNonPaymentPeriod",
					"Description": "With a new policy a minimum number of days must pass before a policy is paid as a result of a death to a suicide. If a suicide occurs within this period the policy is considered to be void.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "SuicideNonPaymentPeriod"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "IncontestablePeriod",
					"Description": "The specific number of days after which the insurer shall not be able to contest the statements contained in the application.\n\nAn insurance policy clause that provides that after a policy has been in effect for a given length of time, the insurer shall not be able to contest the statements contained in the application.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "IncontestablePeriod"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "CancellationUponNoticePeriod",
					"Description": "The number of days notice that the insurer must provide the insured prior to canceling the policy.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "CancellationUponNoticePeriod"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "CoinsurancePercentage",
					"Description": "The percentage of losses that will be shared between the insurer and insured.\n\nReference the Coinsurance Clause.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "CoinsurancePercentage"
					},
					"OriginDataTypeName": {
						"TypeName": "decimal",
						"IsComplexType": false,
						"IsNullable": true,
						"Precision": 18,
						"Scale": 8,
						"Properties": {
							"HIVE_TYPE_STRING": "decimal"
						}
					}
				},
				{
					"Name": "AgeChangeDate",
					"Description": "The date on which a persons age changes for insurance purposes.\n\nIn most life insurance contracts this the date midway between the insured's natural birth dates.\n\nOn the date of age change, a person's age may change to that of the last birth date, the nearer birth date or the next birth date depending upon the way in which the rating structure has been established by the insurer.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "AgeChangeDate"
					},
					"OriginDataTypeName": {
						"TypeName": "date",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"DateFormat": "YYYY-MM-DD",
							"HIVE_TYPE_STRING": "date"
						}
					}
				},
				{
					"Name": "AgeLimitStatement",
					"Description": "A statement describing the insurer's policy for ages or above in which the insurer will not write certain forms of insurance or above which it will not continue a policy in force.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "AgeLimitStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "AgeLimit",
					"Description": "The age in years above in which the insurer will not write certain forms of insurance or above which it will not continue a policy in force.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "AgeLimit"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "PolicyLoanProvision",
					"Description": "A part of the insurance policy that addresses loans made by the insurer to the policyholder in which the policy's cash value is assigned as security for the loan.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "PolicyLoanProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "GracePeriodProvision",
					"Description": "A part of the insurance policy that states the period of time after the due date of a premium during which the policy remains in force with penalty.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "GracePeriodProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "CollateralAssignmentProvision",
					"Description": "A part of an insurance policy dealing with the assignment of a policy to a creditor as security for a debt.  The creditor is entitled to be reimbursed out of policy proceeds for the amount owed.  The beneficiary is entitled to any excess of policy proceeds over the amount due the creditor in the event of the insured's death.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "CollateralAssignmentProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "SuicideProvision",
					"Description": "A part of an insurance policy the provides that if the insured commits suicide within a specified period, usually two years after the issue date, the company's liability will be limited to a return of the premiums paid.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "SuicideProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "AcceleratedBenefitsProvision",
					"Description": "Accelerated Benefits Provisions provide from the early payment of some portion of the policy face amount should the insurer suffer from a terminal illness or injury.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "AcceleratedBenefitsProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "WarClauseProvision",
					"Description": "Relieves the insurer of liability or reduces the liability for the specified loss caused by war.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "WarClauseProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "NarcoticsProvision",
					"Description": "Relieves the insurer of liability or reduces the liability for the specified loss caused by use of narcotics.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "NarcoticsProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "IntoxicantsProvision",
					"Description": "Relieves the insurer of liability or reduces the liability for the specified loss caused by intoxicants.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "IntoxicantsProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "IllegalOccupationProvision",
					"Description": "A provision that defines the effect upon the insurance policy by participation of the insured in illegal activities.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "IllegalOccupationProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "ContestableProvision",
					"Description": "A provision in an insurance policy establishing the conditions under which or the period of time during which the insurer may contest or void the policy.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ContestableProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "DelayedPaymentProvision",
					"Description": "A provision that defers payment to the beneficiary for a specified period after the death of the insured with proceeds to be paid to contingent beneficiaries or the estate if the primary beneficiary does not survive the delay.\n\nIt is a method of handling common-disaster situations such as the death of the insured and the primary beneficiary occurring in the same accident.   The clause normally states that the beneficiary has to survive the death of the insured by a certain period of time in order to collect.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "DelayedPaymentProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "InterestSensitiveProvision",
					"Description": "Provisions in variable and flexible premium policies that guarantee specific interest earnings plus an additional interest percentage should the current interest rate rise above a pre-defined percentage.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "InterestSensitiveProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "ReinstatementProvision",
					"Description": "A part of the insurance policy addressing the reinstatement of the policy after having lapsed by producing evidence of insurability and paying any past-due premiums required.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ReinstatementProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "CoinsuranceProvision",
					"Description": "A provision stating that the insured and the insurer will share all losses covered by the policy in a proportion agreed upon in advance.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "CoinsuranceProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "FreelookProvision",
					"Description": "An insurance policy clause dealing with the period of time (usually 10-30 days) during which a policyholder may examine a newly-issued individual policy of life or health insurance and may surrender it in exchange for a full refund of premium if not satisfied for any reason.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "FreelookProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "AssignmentProvision",
					"Description": "A part of the insurance policy that allows the policyholder to assign benefits to another party.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "AssignmentProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "AutomaticPremiumLoanProvision",
					"Description": "The provision authorizes the insurer to automatically pay any premium in default at the end of the grace period and charge the amount paid against the life insurance policy as a policy loan.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "AutomaticPremiumLoanProvision"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "InsuringClause",
					"Description": "The part of an insurance contract that states the perils insured against, person(s) covered, locations and the period of the contract.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "InsuringClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "IncontestableClause",
					"Description": "A part of the insurance policy providing that for certain reasons such as misstatements on the application the company may void a life policy after it has been in force during the insured's lifetime.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "IncontestableClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "MisstatementOfAgeClause",
					"Description": "A part of an insurance policy stating that if the insured's age is misstated in an application for insurance, the benefit payable usually is adjusted to what the premiums paid should have purchased.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "MisstatementOfAgeClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "MisstatementOfSexClause",
					"Description": "A part of an insurance policy stating that if the insured's sex is misstated in an application for insurance, the benefit payable usually is adjusted to what the premiums paid should have purchased.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "MisstatementOfSexClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "AbsoluteAssignmentClause",
					"Description": "A part of an insurance policy stating that the assignee receives full control over the policy and also full rights to its benefits.  When a policy is assigned to secure a debt, the owner retains all rights in the policy in excess of the debt, even though the assignment is absolute in form.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "AbsoluteAssignmentClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "OptionToConvertClause",
					"Description": "The option to convert gives the insured the right to convert or exchange the term policy for a whole life or permanent plan without evidence of insurability.\n\nThis exchange involves the issuance of a new whole life policy at a premium that is in line with the insured's age at either the time of the exchange ('attained age method') or at the time when the original term policy was taken out ('original age method')",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "OptionToConvertClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "BeneficiaryDesignationClause",
					"Description": "A clause defining how a beneficiary can be designated.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "BeneficiaryDesignationClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "PolicyDividendsClause",
					"Description": "A part of the insurance policy defining the payment method, period and amount of dividends to be paid by the insurance policy.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "PolicyDividendsClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "SettlementOptionsClause",
					"Description": "The part of the insurance policy that determines the settlement option selected for the insurance policy:\n\n- lump-sum cash\n- interest-only\n- fixed-period\n- fixed-amount\n- life income68",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "SettlementOptionsClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "SpendthriftTrustClause",
					"Description": "A part of an insurance policy that states that to the extent permitted by the law, policy proceeds shall not be subject to the claims of creditors of the beneficiary or policyowner.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "SpendthriftTrustClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "NonforfeitureOptionClause",
					"Description": "A part of the insurance policy detailing privileges allowed under terms of a life insurance contract after cash values have been created.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "NonforfeitureOptionClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "FacilityOfPaymentClause",
					"Description": "A part of an insurance policy allowing the company to pay up to $1,000 of benefits or proceeds to any relative appearing entitles to it if there is no beneficiary or if the insured or beneficiary is a minor or legally incompetent.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "FacilityOfPaymentClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "OptionToRenewClause",
					"Description": "The terms and conditions of the insurance policy defining the renewability of the insurance policy.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "OptionToRenewClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "PolicyLoanOptionClause",
					"Description": "A part of the insurance policy defining the terms under which a loan may be made by the insurance company to the policyholder with the policy cash value assigned as security.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "PolicyLoanOptionClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "DeathBenefitsProceedsPaymentMethodClause",
					"Description": "A part of the insurance policy defining the method of payment of death benefits for the insurance policy.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "DeathBenefitsProceedsPaymentMethodClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "ConsiderationClause",
					"Description": "That part of an insurance contract setting forth the amount of initial and renewal premiums and the frequency of future payments.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ConsiderationClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "SimultaneousDeathClause",
					"Description": "A part of an insurance policy dealing the simultaneous death of both/all beneficiaries",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "SimultaneousDeathClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "PhysicalExamClause",
					"Description": "Indicates that a physical exam is/is not  required for renewal.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "PhysicalExamClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "PolicyCancellationClause",
					"Description": "A part of an insurance policy dealing the terms and conditions for cancellation of the policy.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "PolicyCancellationClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "MedicalReportRequiredForMaximumAmountInsuranceIndicator",
					"Description": "Indicates that a medical report is required for acceptance of the insured for the maximum amount of insurance.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "MedicalReportRequiredForMaximumAmountInsuranceIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "ReinstatablePolicyIndicator",
					"Description": "Indicates that the insurance policy is reinstatable.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ReinstatablePolicyIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "AssignableProductIndicator",
					"Description": "An indicator indicating that the insurance product is assignable to a third party.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "AssignableProductIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "ReinstatementRequiresNewContestablePeriodIndicator",
					"Description": "Indicates that reinstatement of the insurance policy requires that a new contestable period be defined.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ReinstatementRequiresNewContestablePeriodIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "OptionToConvertIndicator",
					"Description": "An indicator indicating that there is an option to convert the insurance product to a new policy that will continue the insurance coverage before the original insurance policy expires.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "OptionToConvertIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "OptionToRenewIndicator",
					"Description": "The option to renew feature allows the policyowner to renew the term of the policy prior to the termination date without providing evidence of insurability.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "OptionToRenewIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "ReEntryOptionIndicator",
					"Description": "Indicates that in a renewable term life policy under which the policyholder is guaranteed to be able to renew his coverage without evidence of insurability at a premium rate specified in the insurance policy.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ReEntryOptionIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "ParticipatingNonParticipatingPolicyIndicator",
					"Description": "Indicates that the insurance policy pays dividends.\n\nIt entitles the policyholder to participate in allocations of the insurer's surplus.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ParticipatingNonParticipatingPolicyIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "AviationExclusionIndicator",
					"Description": "Death due to aviation are excluded from the insurance policy - except typically 'other than a fare-paying passenger'.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "AviationExclusionIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "ChangeOfOccupationProvisionIndicator",
					"Description": "Indicates that the insurance will/will not remain in effect in case of change of occupation.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ChangeOfOccupationProvisionIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "AdjustablePremiumIndicator",
					"Description": "Indicates that the insurer has the right to change the premium rate at the time of policy renewal.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "AdjustablePremiumIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "CommutationRightsIndicator",
					"Description": "The right of a beneficiary to receive in one sum the unpaid payments remaining under an installment option which was selected for the settlement of the proceeds or values of a life insurance policy.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "CommutationRightsIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "ConvertibleInsuranceIndicator",
					"Description": "A policy that may be changed to another form by contractual provision and without evidence of insurability.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ConvertibleInsuranceIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "GroundTransportationCoveredIndicator",
					"Description": "Indicates whether ground transportation to and from the airport is covered by the policy.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "GroundTransportationCoveredIndicator"
					},
					"OriginDataTypeName": {
						"TypeName": "boolean",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "boolean"
						}
					}
				},
				{
					"Name": "InsuranceCompanyId",
					"Description": "The unique identifier of a Customer.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "InsuranceCompanyId"
					},
					"OriginDataTypeName": {
						"TypeName": "long",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "long"
						}
					}
				},
				{
					"Name": "ProductTypeId",
					"Description": "The unique identifier of a Product Type.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "ProductTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "PremiumTaxTreatmentTypeId",
					"Description": "The unique identifier of a premium tax treatment type.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "PremiumTaxTreatmentTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "MecClassificationTypeId",
					"Description": "The unique identifier of the insurance policy MEC type.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "MecClassificationTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "LifeInsuranceProductParticipatoryStatusTypeId",
					"Description": "The unique identifier of a Life Insurance Product Participatory Status Type.",
					"BaseAttributeReference": {
						"Entity": "LifeProduct.cdm.json/LifeProduct",
						"Name": "LifeInsuranceProductParticipatoryStatusTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				}
			],
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"ProductId\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ProductId\"},\"ProductName\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ProductName\"},\"ProductDescription\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ProductDescription\"},\"MinimumFaceValueAmount\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MinimumFaceValueAmount\"},\"MaximumFaceValueAmount\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MaximumFaceValueAmount\"},\"MaximumAllowableLoanRate\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MaximumAllowableLoanRate\"},\"GracePeriod\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"GracePeriod\"},\"ReinstatementPeriod\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ReinstatementPeriod\"},\"StandardPremium\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"StandardPremium\"},\"SuicideNonPaymentPeriod\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"SuicideNonPaymentPeriod\"},\"IncontestablePeriod\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"IncontestablePeriod\"},\"CancellationUponNoticePeriod\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"CancellationUponNoticePeriod\"},\"CoinsurancePercentage\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"CoinsurancePercentage\"},\"AgeChangeDate\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AgeChangeDate\"},\"AgeLimitStatement\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AgeLimitStatement\"},\"AgeLimit\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AgeLimit\"},\"PolicyLoanProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PolicyLoanProvision\"},\"GracePeriodProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"GracePeriodProvision\"},\"CollateralAssignmentProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"CollateralAssignmentProvision\"},\"SuicideProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"SuicideProvision\"},\"AcceleratedBenefitsProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AcceleratedBenefitsProvision\"},\"WarClauseProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"WarClauseProvision\"},\"NarcoticsProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"NarcoticsProvision\"},\"IntoxicantsProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"IntoxicantsProvision\"},\"IllegalOccupationProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"IllegalOccupationProvision\"},\"ContestableProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ContestableProvision\"},\"DelayedPaymentProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"DelayedPaymentProvision\"},\"InterestSensitiveProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"InterestSensitiveProvision\"},\"ReinstatementProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ReinstatementProvision\"},\"CoinsuranceProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"CoinsuranceProvision\"},\"FreelookProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"FreelookProvision\"},\"AssignmentProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AssignmentProvision\"},\"AutomaticPremiumLoanProvision\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AutomaticPremiumLoanProvision\"},\"InsuringClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"InsuringClause\"},\"IncontestableClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"IncontestableClause\"},\"MisstatementOfAgeClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MisstatementOfAgeClause\"},\"MisstatementOfSexClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MisstatementOfSexClause\"},\"AbsoluteAssignmentClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AbsoluteAssignmentClause\"},\"OptionToConvertClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"OptionToConvertClause\"},\"BeneficiaryDesignationClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"BeneficiaryDesignationClause\"},\"PolicyDividendsClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PolicyDividendsClause\"},\"SettlementOptionsClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"SettlementOptionsClause\"},\"SpendthriftTrustClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"SpendthriftTrustClause\"},\"NonforfeitureOptionClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"NonforfeitureOptionClause\"},\"FacilityOfPaymentClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"FacilityOfPaymentClause\"},\"OptionToRenewClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"OptionToRenewClause\"},\"PolicyLoanOptionClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PolicyLoanOptionClause\"},\"DeathBenefitsProceedsPaymentMethodClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"DeathBenefitsProceedsPaymentMethodClause\"},\"ConsiderationClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ConsiderationClause\"},\"SimultaneousDeathClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"SimultaneousDeathClause\"},\"PhysicalExamClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PhysicalExamClause\"},\"PolicyCancellationClause\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PolicyCancellationClause\"},\"MedicalReportRequiredForMaximumAmountInsuranceIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MedicalReportRequiredForMaximumAmountInsuranceIndicator\"},\"ReinstatablePolicyIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ReinstatablePolicyIndicator\"},\"AssignableProductIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AssignableProductIndicator\"},\"ReinstatementRequiresNewContestablePeriodIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ReinstatementRequiresNewContestablePeriodIndicator\"},\"OptionToConvertIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"OptionToConvertIndicator\"},\"OptionToRenewIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"OptionToRenewIndicator\"},\"ReEntryOptionIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ReEntryOptionIndicator\"},\"ParticipatingNonParticipatingPolicyIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ParticipatingNonParticipatingPolicyIndicator\"},\"AviationExclusionIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AviationExclusionIndicator\"},\"ChangeOfOccupationProvisionIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ChangeOfOccupationProvisionIndicator\"},\"AdjustablePremiumIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AdjustablePremiumIndicator\"},\"CommutationRightsIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"CommutationRightsIndicator\"},\"ConvertibleInsuranceIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ConvertibleInsuranceIndicator\"},\"GroundTransportationCoveredIndicator\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"GroundTransportationCoveredIndicator\"},\"InsuranceCompanyId\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"InsuranceCompanyId\"},\"ProductTypeId\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ProductTypeId\"},\"PremiumTaxTreatmentTypeId\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PremiumTaxTreatmentTypeId\"},\"MecClassificationTypeId\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MecClassificationTypeId\"},\"LifeInsuranceProductParticipatoryStatusTypeId\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"LifeInsuranceProductParticipatoryStatusTypeId\"}}}"
			},
			"Compressed": false,
			"IsStoredAsSubdirectories": false
		},
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"LifeProduct\",\"path\":\"LifeProduct.cdm.json/LifeProduct\"},\"description\":\"A product is anything that can be offered to a market that might satisfy a want or need by potential customers.    That product is the sum of all physical, psychological, symbolic, and service attributes associated with it.\\n\\nThere are two basic types of products:\\n\\n- Tangible (physical)\\n- Intangible (non-physical) such as services\\n\\nA service is a non-material or intangible product - such as professional consultancy, maintenance service, repair service etc.\\nEach product has its own benefits, application, brand name, and packaging that gives it its own identity and distinguishing characteristics.\\n\\nEvery business or organization has business rules that define precisely what a product is.    While we intuitively know what a product is, we must quantify that knowledge and associated business rules with consistent definitions that can be implemented within the organization in strategies and applications.\\n\\nA product typically goes through five stages of development:\\n\\n(1) Idea Stage - involving a thorough evaluation of the potential product\\n\\n(2) Concept Stage - determines customer acceptance by testing and presentation to consumers and distribution channel members.   Specific aspects regarding quality, dependability, reliability, warranty, packaging, service, pricing, terms of sale, sales and distribution channels, advertising and promotions are evaluated.\\n\\n(3) Product Development Stage - transforms the prototype product into an actual product for mass sale.   This stage requires close interaction between both marketing and manufacturing.\\n\\n(4) Test Marketing Stage - may or may not be used since it is an expensive and time-consuming process.  Test marketing involves evaluating various product options and alternatives.\\n\\n(5) Commercialization - It is very expensive to launch a new product so commercialization only applies to those specific products that are actually going to be sold to the market.\\n\\nProducts tend to be categorized as either:  Industrial goods and consumer goods\\n\\nIndustrial goods are used to produce other products .\\n\\nIndustrial goods may be further divided into:\\n\\n- Raw materials\\n- Equipment\\n- Pre-built materials \\n- Supplies.\\n\\nConsumer goods are intended for consumption by the general public.\\n\\nConsumer goods may be further divided into:\\n\\n- Durable goods\\n- Nondurable goods\\n- Packaged goods\\n\\nA product may be a member of a product family or product line.\\n\\nA product family is a grouping of products or services that are related to each other by common function, functionality, design platform or similar characteristics.\\n\\nMembers of a product family frequently have many common parts and assemblies.\\n\\nProduct families are the highest level of grouping for forecasting, capacity planning or related functions.\\n\\nEx:\\nThe Apple Macintosh family of products consists of the product lines:\\n- Mac mini\\n- MacBook Pro\\n- Mac Pro\\n\\nA product line is a grouping of products that are closely related in usage, functionality or marketing characteristics.\\n\\nA Product Family typically is created to address one or five functions:\\n\\n1. To increase profits and not erode the sales of existing products\\n\\n2. To attract additional Markets or Market Segments\\n\\n3. To counter competitor's products\\n\\n4. To fill a gap in an existing Product Family.\\n\\n5. To promote sales of other products in the family line\\n\\nLine Depth refers to the number of products in the product line.\\n\\nLine consistency refers to how closely related the products are that make up the product line.\\n\\nLine vulnerability refers to the percentage of sales or profits that are derived from only a few products in the product line.\\n\\nProduct width refers to the number of different product lines sold by a company.\\n\\nProduct mix refers to the total number of products sold in all product lines.\\n\\nLine extension refers to the adding of a new product to a line.\\n\\n\\\"Trading up or brand leveraging\\\" refers to adding a product of better quality to a product line than the other products in that line.\\n\\n\\\"Trading down\\\" refers to adding a product of lesser quality to a product line than the other products in that line.\\n\\nIf a line of products is sold with the same brand name, this is referred to as family branding.\\nStrategy and decisions regarding a product line are usually incorporated in a high-level marketing plan addressing product line strategy, sales, channels, distribution channels, pricing and related issues.\\nA product-line manager is responsible for a product line and supervises several product managers who are responsible for individual products within the line.\\nProduct-line managers typically have the following responsibilities:\\n- Expansion and composition of a product line\\n- Evaluate the effects of product mixes on the profitability of other items in the line\\n- Planning and allocation of resources to individual products in the line\\nA product is normally associated with a brand strategy - manufacturer, private or generic.\\n\\n1. Manufacturer-  or 'national' branding in which the brand is assigned by the manufacturer of the Product.\\n\\n2. Private - or 'dealer' branding in which the brand is assigned by the retailer or wholesaler of the Product.\\n\\n3. Generic - in which the Product is not marked with any identification.   Generic brands are a means for manufacturers to increase profits by saving on advertising, packaging or other costs associated with manufacturer or private branding.\\n\\nA brand is name, term, sign, symbol or design or a combination of these which identify the goods or services and differentiate them from those of competitors'\\n\\nA Trade mark is a brand or some part of the brand that is given legal protection because it is capable of exclusive appropriation and representation.\\n\\nManufacturers can use their own brands (known as Manufacturers' brands) or brands of their distributors (Distributors' brands).\\n\\nManufacturers/ distributors use brand names for a variety of reasons ranging from simple identification purposes to having legal protection for unique features of the products from imitations.\\n\\nBrands help consumers recognize certain quality parameters. In some cases, brands are just used to endow the product with unique story and character which itself can be a basis for product differentiation.\\n\\nIndividual brands have their own identity and the corporate or common name is not used to promote its equity.\\n\\nIndividual branding requires more expensive advertising and brand extensive brand creation investments.  By extension, each new brand does not benefit from the positive perceptions of earlier brands.\\n\\nBy contrast, family branding has several advantages.\\n\\nEach new product is quickly associated with the other products and brand in terms of quality and benefits.\\n\\nReduced or eliminated time for name identification and advertising for name recognition purposes.\",\"primaryKey\":[\"ProductId\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ProductId\"},\"dataType\":\"long\",\"description\":\"The unique identifier of a Product.\",\"isNullable\":false,\"name\":\"ProductId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ProductName\"},\"dataType\":\"string\",\"dataTypeLength\":128,\"description\":\"The name of the Product, which normally corresponds to the 'marketing name' of the Product.\",\"isNullable\":true,\"name\":\"ProductName\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ProductDescription\"},\"dataType\":\"string\",\"dataTypeLength\":512,\"description\":\"The description of the Product.\",\"isNullable\":true,\"name\":\"ProductDescription\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MinimumFaceValueAmount\"},\"dataType\":\"decimal\",\"dataTypeLength\":18,\"description\":\"The minimum face value offerable by the Insurance Product.\",\"isNullable\":true,\"scale\":2,\"name\":\"MinimumFaceValueAmount\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MaximumFaceValueAmount\"},\"dataType\":\"decimal\",\"dataTypeLength\":18,\"description\":\"The maximum face value offerable by the Insurance Product.\",\"isNullable\":true,\"scale\":2,\"name\":\"MaximumFaceValueAmount\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MaximumAllowableLoanRate\"},\"dataType\":\"decimal\",\"dataTypeLength\":18,\"description\":\"The maximum allowable interest rate of policy loans associated with the Insurance Product.\",\"isNullable\":true,\"scale\":8,\"name\":\"MaximumAllowableLoanRate\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"GracePeriod\"},\"dataType\":\"integer\",\"description\":\"A period from the premium due date during which an insurance contract remains in force and the premiums may be paid.\",\"isNullable\":true,\"name\":\"GracePeriod\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ReinstatementPeriod\"},\"dataType\":\"integer\",\"description\":\"The number of days after lapse of the insurance policy that the insurance policy may be reinstated upon payment of past premiums, interest and evidence of continued insurability.\",\"isNullable\":true,\"name\":\"ReinstatementPeriod\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"StandardPremium\"},\"dataType\":\"decimal\",\"dataTypeLength\":18,\"description\":\"The baseline or 'standard' premium against which risks and assessment are added to determine the actual premium.\",\"isNullable\":true,\"scale\":2,\"name\":\"StandardPremium\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"SuicideNonPaymentPeriod\"},\"dataType\":\"integer\",\"description\":\"With a new policy a minimum number of days must pass before a policy is paid as a result of a death to a suicide. If a suicide occurs within this period the policy is considered to be void.\",\"isNullable\":true,\"name\":\"SuicideNonPaymentPeriod\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"IncontestablePeriod\"},\"dataType\":\"integer\",\"description\":\"The specific number of days after which the insurer shall not be able to contest the statements contained in the application.\\n\\nAn insurance policy clause that provides that after a policy has been in effect for a given length of time, the insurer shall not be able to contest the statements contained in the application.\",\"isNullable\":true,\"name\":\"IncontestablePeriod\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"CancellationUponNoticePeriod\"},\"dataType\":\"integer\",\"description\":\"The number of days notice that the insurer must provide the insured prior to canceling the policy.\",\"isNullable\":true,\"name\":\"CancellationUponNoticePeriod\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"CoinsurancePercentage\"},\"dataType\":\"decimal\",\"dataTypeLength\":18,\"description\":\"The percentage of losses that will be shared between the insurer and insured.\\n\\nReference the Coinsurance Clause.\",\"isNullable\":true,\"scale\":8,\"name\":\"CoinsurancePercentage\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AgeChangeDate\"},\"dataType\":\"date\",\"dateFormat\":\"YYYY-MM-DD\",\"description\":\"The date on which a persons age changes for insurance purposes.\\n\\nIn most life insurance contracts this the date midway between the insured's natural birth dates.\\n\\nOn the date of age change, a person's age may change to that of the last birth date, the nearer birth date or the next birth date depending upon the way in which the rating structure has been established by the insurer.\",\"isNullable\":true,\"name\":\"AgeChangeDate\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AgeLimitStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A statement describing the insurer's policy for ages or above in which the insurer will not write certain forms of insurance or above which it will not continue a policy in force.\",\"isNullable\":true,\"name\":\"AgeLimitStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AgeLimit\"},\"dataType\":\"integer\",\"description\":\"The age in years above in which the insurer will not write certain forms of insurance or above which it will not continue a policy in force.\",\"isNullable\":true,\"name\":\"AgeLimit\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PolicyLoanProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of the insurance policy that addresses loans made by the insurer to the policyholder in which the policy's cash value is assigned as security for the loan.\",\"isNullable\":true,\"name\":\"PolicyLoanProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"GracePeriodProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of the insurance policy that states the period of time after the due date of a premium during which the policy remains in force with penalty.\",\"isNullable\":true,\"name\":\"GracePeriodProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"CollateralAssignmentProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of an insurance policy dealing with the assignment of a policy to a creditor as security for a debt.  The creditor is entitled to be reimbursed out of policy proceeds for the amount owed.  The beneficiary is entitled to any excess of policy proceeds over the amount due the creditor in the event of the insured's death.\",\"isNullable\":true,\"name\":\"CollateralAssignmentProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"SuicideProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of an insurance policy the provides that if the insured commits suicide within a specified period, usually two years after the issue date, the company's liability will be limited to a return of the premiums paid.\",\"isNullable\":true,\"name\":\"SuicideProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AcceleratedBenefitsProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Accelerated Benefits Provisions provide from the early payment of some portion of the policy face amount should the insurer suffer from a terminal illness or injury.\",\"isNullable\":true,\"name\":\"AcceleratedBenefitsProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"WarClauseProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Relieves the insurer of liability or reduces the liability for the specified loss caused by war.\",\"isNullable\":true,\"name\":\"WarClauseProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"NarcoticsProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Relieves the insurer of liability or reduces the liability for the specified loss caused by use of narcotics.\",\"isNullable\":true,\"name\":\"NarcoticsProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"IntoxicantsProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Relieves the insurer of liability or reduces the liability for the specified loss caused by intoxicants.\",\"isNullable\":true,\"name\":\"IntoxicantsProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"IllegalOccupationProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A provision that defines the effect upon the insurance policy by participation of the insured in illegal activities.\",\"isNullable\":true,\"name\":\"IllegalOccupationProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ContestableProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A provision in an insurance policy establishing the conditions under which or the period of time during which the insurer may contest or void the policy.\",\"isNullable\":true,\"name\":\"ContestableProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"DelayedPaymentProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A provision that defers payment to the beneficiary for a specified period after the death of the insured with proceeds to be paid to contingent beneficiaries or the estate if the primary beneficiary does not survive the delay.\\n\\nIt is a method of handling common-disaster situations such as the death of the insured and the primary beneficiary occurring in the same accident.   The clause normally states that the beneficiary has to survive the death of the insured by a certain period of time in order to collect.\",\"isNullable\":true,\"name\":\"DelayedPaymentProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"InterestSensitiveProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Provisions in variable and flexible premium policies that guarantee specific interest earnings plus an additional interest percentage should the current interest rate rise above a pre-defined percentage.\",\"isNullable\":true,\"name\":\"InterestSensitiveProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ReinstatementProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of the insurance policy addressing the reinstatement of the policy after having lapsed by producing evidence of insurability and paying any past-due premiums required.\",\"isNullable\":true,\"name\":\"ReinstatementProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"CoinsuranceProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A provision stating that the insured and the insurer will share all losses covered by the policy in a proportion agreed upon in advance.\",\"isNullable\":true,\"name\":\"CoinsuranceProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"FreelookProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"An insurance policy clause dealing with the period of time (usually 10-30 days) during which a policyholder may examine a newly-issued individual policy of life or health insurance and may surrender it in exchange for a full refund of premium if not satisfied for any reason.\",\"isNullable\":true,\"name\":\"FreelookProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AssignmentProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of the insurance policy that allows the policyholder to assign benefits to another party.\",\"isNullable\":true,\"name\":\"AssignmentProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AutomaticPremiumLoanProvision\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"The provision authorizes the insurer to automatically pay any premium in default at the end of the grace period and charge the amount paid against the life insurance policy as a policy loan.\",\"isNullable\":true,\"name\":\"AutomaticPremiumLoanProvision\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"InsuringClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"The part of an insurance contract that states the perils insured against, person(s) covered, locations and the period of the contract.\",\"isNullable\":true,\"name\":\"InsuringClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"IncontestableClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of the insurance policy providing that for certain reasons such as misstatements on the application the company may void a life policy after it has been in force during the insured's lifetime.\",\"isNullable\":true,\"name\":\"IncontestableClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MisstatementOfAgeClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of an insurance policy stating that if the insured's age is misstated in an application for insurance, the benefit payable usually is adjusted to what the premiums paid should have purchased.\",\"isNullable\":true,\"name\":\"MisstatementOfAgeClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MisstatementOfSexClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of an insurance policy stating that if the insured's sex is misstated in an application for insurance, the benefit payable usually is adjusted to what the premiums paid should have purchased.\",\"isNullable\":true,\"name\":\"MisstatementOfSexClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AbsoluteAssignmentClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of an insurance policy stating that the assignee receives full control over the policy and also full rights to its benefits.  When a policy is assigned to secure a debt, the owner retains all rights in the policy in excess of the debt, even though the assignment is absolute in form.\",\"isNullable\":true,\"name\":\"AbsoluteAssignmentClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"OptionToConvertClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"The option to convert gives the insured the right to convert or exchange the term policy for a whole life or permanent plan without evidence of insurability.\\n\\nThis exchange involves the issuance of a new whole life policy at a premium that is in line with the insured's age at either the time of the exchange ('attained age method') or at the time when the original term policy was taken out ('original age method')\",\"isNullable\":true,\"name\":\"OptionToConvertClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"BeneficiaryDesignationClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A clause defining how a beneficiary can be designated.\",\"isNullable\":true,\"name\":\"BeneficiaryDesignationClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PolicyDividendsClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of the insurance policy defining the payment method, period and amount of dividends to be paid by the insurance policy.\",\"isNullable\":true,\"name\":\"PolicyDividendsClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"SettlementOptionsClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"The part of the insurance policy that determines the settlement option selected for the insurance policy:\\n\\n- lump-sum cash\\n- interest-only\\n- fixed-period\\n- fixed-amount\\n- life income68\",\"isNullable\":true,\"name\":\"SettlementOptionsClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"SpendthriftTrustClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of an insurance policy that states that to the extent permitted by the law, policy proceeds shall not be subject to the claims of creditors of the beneficiary or policyowner.\",\"isNullable\":true,\"name\":\"SpendthriftTrustClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"NonforfeitureOptionClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of the insurance policy detailing privileges allowed under terms of a life insurance contract after cash values have been created.\",\"isNullable\":true,\"name\":\"NonforfeitureOptionClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"FacilityOfPaymentClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of an insurance policy allowing the company to pay up to $1,000 of benefits or proceeds to any relative appearing entitles to it if there is no beneficiary or if the insured or beneficiary is a minor or legally incompetent.\",\"isNullable\":true,\"name\":\"FacilityOfPaymentClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"OptionToRenewClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"The terms and conditions of the insurance policy defining the renewability of the insurance policy.\",\"isNullable\":true,\"name\":\"OptionToRenewClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PolicyLoanOptionClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of the insurance policy defining the terms under which a loan may be made by the insurance company to the policyholder with the policy cash value assigned as security.\",\"isNullable\":true,\"name\":\"PolicyLoanOptionClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"DeathBenefitsProceedsPaymentMethodClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of the insurance policy defining the method of payment of death benefits for the insurance policy.\",\"isNullable\":true,\"name\":\"DeathBenefitsProceedsPaymentMethodClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ConsiderationClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"That part of an insurance contract setting forth the amount of initial and renewal premiums and the frequency of future payments.\",\"isNullable\":true,\"name\":\"ConsiderationClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"SimultaneousDeathClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of an insurance policy dealing the simultaneous death of both/all beneficiaries\",\"isNullable\":true,\"name\":\"SimultaneousDeathClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PhysicalExamClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Indicates that a physical exam is/is not  required for renewal.\",\"isNullable\":true,\"name\":\"PhysicalExamClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PolicyCancellationClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A part of an insurance policy dealing the terms and conditions for cancellation of the policy.\",\"isNullable\":true,\"name\":\"PolicyCancellationClause\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MedicalReportRequiredForMaximumAmountInsuranceIndicator\"},\"dataType\":\"boolean\",\"description\":\"Indicates that a medical report is required for acceptance of the insured for the maximum amount of insurance.\",\"isNullable\":true,\"name\":\"MedicalReportRequiredForMaximumAmountInsuranceIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ReinstatablePolicyIndicator\"},\"dataType\":\"boolean\",\"description\":\"Indicates that the insurance policy is reinstatable.\",\"isNullable\":true,\"name\":\"ReinstatablePolicyIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AssignableProductIndicator\"},\"dataType\":\"boolean\",\"description\":\"An indicator indicating that the insurance product is assignable to a third party.\",\"isNullable\":true,\"name\":\"AssignableProductIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ReinstatementRequiresNewContestablePeriodIndicator\"},\"dataType\":\"boolean\",\"description\":\"Indicates that reinstatement of the insurance policy requires that a new contestable period be defined.\",\"isNullable\":true,\"name\":\"ReinstatementRequiresNewContestablePeriodIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"OptionToConvertIndicator\"},\"dataType\":\"boolean\",\"description\":\"An indicator indicating that there is an option to convert the insurance product to a new policy that will continue the insurance coverage before the original insurance policy expires.\",\"isNullable\":true,\"name\":\"OptionToConvertIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"OptionToRenewIndicator\"},\"dataType\":\"boolean\",\"description\":\"The option to renew feature allows the policyowner to renew the term of the policy prior to the termination date without providing evidence of insurability.\",\"isNullable\":true,\"name\":\"OptionToRenewIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ReEntryOptionIndicator\"},\"dataType\":\"boolean\",\"description\":\"Indicates that in a renewable term life policy under which the policyholder is guaranteed to be able to renew his coverage without evidence of insurability at a premium rate specified in the insurance policy.\",\"isNullable\":true,\"name\":\"ReEntryOptionIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ParticipatingNonParticipatingPolicyIndicator\"},\"dataType\":\"boolean\",\"description\":\"Indicates that the insurance policy pays dividends.\\n\\nIt entitles the policyholder to participate in allocations of the insurer's surplus.\",\"isNullable\":true,\"name\":\"ParticipatingNonParticipatingPolicyIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AviationExclusionIndicator\"},\"dataType\":\"boolean\",\"description\":\"Death due to aviation are excluded from the insurance policy - except typically 'other than a fare-paying passenger'.\",\"isNullable\":true,\"name\":\"AviationExclusionIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ChangeOfOccupationProvisionIndicator\"},\"dataType\":\"boolean\",\"description\":\"Indicates that the insurance will/will not remain in effect in case of change of occupation.\",\"isNullable\":true,\"name\":\"ChangeOfOccupationProvisionIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"AdjustablePremiumIndicator\"},\"dataType\":\"boolean\",\"description\":\"Indicates that the insurer has the right to change the premium rate at the time of policy renewal.\",\"isNullable\":true,\"name\":\"AdjustablePremiumIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"CommutationRightsIndicator\"},\"dataType\":\"boolean\",\"description\":\"The right of a beneficiary to receive in one sum the unpaid payments remaining under an installment option which was selected for the settlement of the proceeds or values of a life insurance policy.\",\"isNullable\":true,\"name\":\"CommutationRightsIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ConvertibleInsuranceIndicator\"},\"dataType\":\"boolean\",\"description\":\"A policy that may be changed to another form by contractual provision and without evidence of insurability.\",\"isNullable\":true,\"name\":\"ConvertibleInsuranceIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"GroundTransportationCoveredIndicator\"},\"dataType\":\"boolean\",\"description\":\"Indicates whether ground transportation to and from the airport is covered by the policy.\",\"isNullable\":true,\"name\":\"GroundTransportationCoveredIndicator\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"InsuranceCompanyId\"},\"dataType\":\"long\",\"description\":\"The unique identifier of a Customer.\",\"isNullable\":true,\"name\":\"InsuranceCompanyId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"ProductTypeId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a Product Type.\",\"isNullable\":true,\"name\":\"ProductTypeId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"PremiumTaxTreatmentTypeId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a premium tax treatment type.\",\"isNullable\":true,\"name\":\"PremiumTaxTreatmentTypeId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"MecClassificationTypeId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of the insurance policy MEC type.\",\"isNullable\":true,\"name\":\"MecClassificationTypeId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"LifeProduct.cdm.json/LifeProduct\",\"name\":\"LifeInsuranceProductParticipatoryStatusTypeId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a Life Insurance Product Participatory Status Type.\",\"isNullable\":true,\"name\":\"LifeInsuranceProductParticipatoryStatusTypeId\"}]}}}",
			"Description": "A product is anything that can be offered to a market that might satisfy a want or need by potential customers.    That product is the sum of all physical, psychological, symbolic, and service attributes associated with it.\n\nThere are two basic types of products:\n\n- Tangible (physical)\n- Intangible (non-physical) such as services\n\nA service is a non-material or intangible product - such as professional consultancy, maintenance service, repair service etc.\nEach product has its own benefits, application, brand name, and packaging that gives it its own identity and distinguishing characteristics.\n\nEvery business or organization has business rules that define precisely what a product is.    While we intuitively know what a product is, we must quantify that knowledge and associated business rules with consistent definitions that can be implemented within the organization in strategies and applications.\n\nA product typically goes through five stages of development:\n\n(1) Idea Stage - involving a thorough evaluation of the potential product\n\n(2) Concept Stage - determines customer acceptance by testing and presentation to consumers and distribution channel members.   Specific aspects regarding quality, dependability, reliability, warranty, packaging, service, pricing, terms of sale, sales and distribution channels, advertising and promotions are evaluated.\n\n(3) Product Development Stage - transforms the prototype product into an actual product for mass sale.   This stage requires close interaction between both marketing and manufacturing.\n\n(4) Test Marketing Stage - may or may not be used since it is an expensive and time-consuming process.  Test marketing involves evaluating various product options and alternatives.\n\n(5) Commercialization - It is very expensive to launch a new product so commercialization only applies to those specific products that are actually going to be sold to the market.\n\nProducts tend to be categorized as either:  Industrial goods and consumer goods\n\nIndustrial goods are used to produce other products .\n\nIndustrial goods may be further divided into:\n\n- Raw materials\n- Equipment\n- Pre-built materials \n- Supplies.\n\nConsumer goods are intended for consumption by the general public.\n\nConsumer goods may be further divided into:\n\n- Durable goods\n- Nondurable goods\n- Packaged goods\n\nA product may be a member of a product family or product line.\n\nA product family is a grouping of products or services that are related to each other by common function, functionality, design platform or similar characteristics.\n\nMembers of a product family frequently have many common parts and assemblies.\n\nProduct families are the highest level of grouping for forecasting, capacity planning or related functions.\n\nEx:\nThe Apple Macintosh family of products consists of the product lines:\n- Mac mini\n- MacBook Pro\n- Mac Pro\n\nA product line is a grouping of products that are closely related in usage, functionality or marketing characteristics.\n\nA Product Family typically is created to address one or five functions:\n\n1. To increase profits and not erode the sales of existing products\n\n2. To attract additional Markets or Market Segments\n\n3. To counter competitor's products\n\n4. To fill a gap in an existing Product Family.\n\n5. To promote sales of other products in the family line\n\nLine Depth refers to the number of products in the product line.\n\nLine consistency refers to how closely related the products are that make up the product line.\n\nLine vulnerability refers to the percentage of sales or profits that are derived from only a few products in the product line.\n\nProduct width refers to the number of different product lines sold by a company.\n\nProduct mix refers to the total number of products sold in all product lines.\n\nLine extension refers to the adding of a new product to a line.\n\n\"Trading up or brand leveraging\" refers to adding a product of better quality to a product line than the other products in that line.\n\n\"Trading down\" refers to adding a product of lesser quality to a product line than the other products in that line.\n\nIf a line of products is sold with the same brand name, this is referred to as family branding.\nStrategy and decisions regarding a product line are usually incorporated in a high-level marketing plan addressing product line strategy, sales, channels, distribution channels, pricing and related issues.\nA product-line manager is responsible for a product line and supervises several product managers who are responsible for individual products within the line.\nProduct-line managers typically have the following responsibilities:\n- Expansion and composition of a product line\n- Evaluate the effects of product mixes on the profitability of other items in the line\n- Planning and allocation of resources to individual products in the line\nA product is normally associated with a brand strategy - manufacturer, private or generic.\n\n1. Manufacturer-  or 'national' branding in which the brand is assigned by the manufacturer of the Product.\n\n2. Private - or 'dealer' branding in which the brand is assigned by the retailer or wholesaler of the Product.\n\n3. Generic - in which the Product is not marked with any identification.   Generic brands are a means for manufacturers to increase profits by saving on advertising, packaging or other costs associated with manufacturer or private branding.\n\nA brand is name, term, sign, symbol or design or a combination of these which identify the goods or services and differentiate them from those of competitors'\n\nA Trade mark is a brand or some part of the brand that is given legal protection because it is capable of exclusive appropriation and representation.\n\nManufacturers can use their own brands (known as Manufacturers' brands) or brands of their distributors (Distributors' brands).\n\nManufacturers/ distributors use brand names for a variety of reasons ranging from simple identification purposes to having legal protection for unique features of the products from imitations.\n\nBrands help consumers recognize certain quality parameters. In some cases, brands are just used to endow the product with unique story and character which itself can be a basis for product differentiation.\n\nIndividual brands have their own identity and the corporate or common name is not used to promote its equity.\n\nIndividual branding requires more expensive advertising and brand extensive brand creation investments.  By extension, each new brand does not benefit from the positive perceptions of earlier brands.\n\nBy contrast, family branding has several advantages.\n\nEach new product is quickly associated with the other products and brand in terms of quality and benefits.\n\nReduced or eliminated time for name identification and advertising for name recognition purposes.",
			"DisplayFolderInfo": "{\"name\":\"Product\",\"colorCode\":\"#7D0F6C\"}",
			"PrimaryKeys": "ProductId"
		},
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false
	},
	"type": "TABLE"
}