{
	"name": "OtherLifeInsurance",
	"properties": {
		"Name": "OtherLifeInsurance",
		"EntityType": "TABLE",
		"Namespace": {
			"DatabaseName": "Database1"
		},
		"Description": "There are many other types of life insurance product types. Some of these are briefly described below.\n\nEx.:\n- ACCELERATION LIFE INSURANCE\n- ACCELERATIVE ENDOWMENT LIFE INSURANCE\n- ADJUSTABLE LIFE INSURANCE\n- AVIATION TRIP LIFE INSURANCE\n- BLANKET LIFE\n- CASH VALUE LIFE INSURANCE\n- CHARITABLE GIFT LIFE INSURANCE\n- CONTINUOUS PREMIUM WHOLE LIFE INSURANCE\n- CONVERTIBLE TERM LIFE INSURANCE\n- CREDIT LIFE INSURANCE\n- CROSS PURCHASE PLAN\n- CURRENT ASSUMPTION WHOLE LIFE INSURANCE\n- DEATH BENEFIT ONLY LIFE INSURANCE\n- DECREASING TERM LIFE INSURANCE\n- DEPOSIT TERM LIFE INSURANCE\n- DOUBLE-PROTECTION LIFE\n- ENDOWMENT LIFE INSURANCE\n- ENHANCED ORDINARY LIFE INSURANCE\n- ENTITY PLAN\n- FAMILY MAINTENANCE INSURANCE\n- FAMILY INCOME INSURANCE\n- FIRST-TO-DIE LIFE INSURANCE\n- FLEXIBLE ENHANCED ORDINARY LIFE INSURANCE\n- FLEXIBLE SPENDING ACCOUNT LIFE INSURANCE\n- FRANCHISE LIFE\n- FRATERNAL LIFE INSURANCE\n- GROUP CREDIT LIFE\n- GROUP PERMANENT LIFE INSURANCE\n- GROUP TERM LIFE INSURANCE\n- GROUP UNIVERSAL LIFE INSURANCE\n- GUARANTEED COST NONPARTICIPATING LIFE INSURANCE\n- INDEXED LIFE INSURANCE\n- INDUSTRIAL LIFE INSURANCE\n- IRREVOCABLE LIFE INSURANCE TRUST\n- JOINT LIFE AND SURVIVOR INSURANCE\n- JOINT LIFE INSURANCE\n- JUVENILE INSURANCE\n- KEY EMPLOYEES LIFE INSURANCE\n- LEVERAGED SPLIT DOLLAR LIFE INSURANCE\n- LIMITED PAYMENT LIFE INSURANCE\n- MULTIPLE EMPLOYER TRUST (MET)\n- MULTIPLE PROTECTION LIFE INSURANCE\n- PARTNERSHIP LIFE INSURANCE\n- PERMANENT LIFE INSURANCE\n- PURE ENDOWMENT\n- RE-ENTRY TERM LIFE INSURANCE\n- RENEWABLE TERM LIFE INSURANCE\n- REVERSE SPLIT DOLLAR LIFE INSURANCE\n- SAVINGS BANK LIFE INSURANCE\n- SPLIT DOLLAR COLLATERAL LIFE INSURANCE\n- SPLIT DOLLAR ENDOWMENT LIFE INSURANCE\n- SPLIT DOLLAR LIFE INSURANCE\n- SPLIT LIFE INSURANCE\n- SURVIVORSHIP LIFE INSURANCE\n- UNIVERSAL VARIABLE LIFE INSURANCE\n- VARIABLE LIFE INSURANCE\n- VARIABLE PREMIUM LIFE INSURANCE\n\nwhere:\n\nACCELERATION LIFE INSURANCE: \nA type of life insurance policy in which a portion of the Death Benefit is payable to the insured for a pre-specified medical condition prior to death.\n\nThe intent of the accelerated death benefit is to provide the money required to finance medical costs to improve or extend the life of the insured.   \n\nWhen presented with proof that the specified medical condition exists, the insurance company will pay the percentage of the death benefit to the insured.  \n\nThe remainder of the death benefit is paid to the beneficiary upon the death of the insured as in a traditional life insurance policy.\n\nACCELERATIVE ENDOWMENT LIFE INSURANCE: \nA type life Insurance policy in which the dividends that accrue are applied to the matured policy as endowment insurance.\n\nADJUSTABLE LIFE INSURANCE: \nLife insurance coverage in which several policy components may be changed or modified at the discretion of the policyowner without writing issuing additional policies.\n\nThe components that can be changed are typically:\n\n(1)  The face value of the policy can be increased or decreased.    The cash value will be reflected in the amount of the face value and premium.\n\n(2)  Premiums and the premiums payment schedule can be increased or decreased.\n\nUnscheduled premiums can be paid in a single lump-sum amount.\n\nAVIATION TRIP LIFE INSURANCE: \nTerm life insurance that provides a death payment to the passenger's beneficiary in the event of a fatal aviation accident.  \n\nTypically the insurance is purchased at an airport by the passenger.\n\nThe term of the coverage is normally from the time that the passenger enters the airplane until the time that he departs the airplane.     Sometimes ground transportation to and from the airport is covered.\n\nBLANKET LIFE: \nBlanket life insurance covers a group of people exposed to a common hazard.\n\nIndividuals do not need to apply for blanket coverage and insurers do not need to provide each person with a certificate of coverage.   Insured parties are also not specifically named in the policy because it is temporary coverage.\n\nAn example is a policy issued to the owner of an airline to cover passengers.\n\nCASH VALUE LIFE INSURANCE: \nA life insurance policy that incorporates a savings element.   \n\nThe size of the cash value depends on the cash value amount and the age of the policy owner\n\nThe policyowner has options based upon the cash value to convert to a monthly retirement income.\n\nThe size of the cash value accumulating differs from company to company.\n\nCHARITABLE GIFT LIFE INSURANCE: \nAn annuity donation made by a donor to a charity.\n\nThe charity agrees to pay the donor an amount of the rest of the donor's life.\n\nThe donation is used to fund an annuity, only a percentage of the donation can be taken as a tax deductible gift in the year of the donation.\n\nThe donor is dependent on the charity to make income payments and therefore should ascertain the ability of the charity to maintain those payments.\n\nThis annuity permits the donor to transfer appreciated property to a charitable organization in exchange for the promise by the organization to pay a continuous stream of income through his life.\n\nCONTINUOUS PREMIUM WHOLE LIFE INSURANCE: \nA life insurance policy that remains in effect for the life of the insured with premiums made for the same period.\n\nCONVERTIBLE TERM LIFE INSURANCE: \nLife insurance that can be converted into permanent life insurance regardless of an insured's physical condition and without a medical examination.\n\nThe individual cannot be denied covered or charged additional premiums for health problems.\n\nCREDIT LIFE INSURANCE: \nLife insurance that is designed to cover the life of a debtor and pay an amount due on a loan if the debtor dies before the loan is repaid.\n\nThis insurance is decreasing term where the term matches the length of the loan period and the decreasing insurance amount matched to the declining loan balance.\n\nCROSS PURCHASE PLAN: \nA binding buy-sell agreement used in partnerships in which each partner agrees to purchase the business interest of a deceased or disabled partner.\n\nCURRENT ASSUMPTION WHOLE LIFE INSURANCE: \nA life insurance policy that is a variation of Ordinary Life Insurance in which the mortality experience and investment earnings are credited to the insurance policy either through the cash value account and/or premium structure or the dividend structure.\n\nThe policy is characterized by:\n\n(1)  Premiums subject to change.  \n\n These are not controlled by the insurance company, not the policyowner.\n\n(2)  The policyowner can use the cash value to make loans.\n\n(3)  A minimum amount of cash value is guaranteed\n\n(4)  The death benefit does not fluctuate\n\nThis type of insurance is also known as 'Interest-Sensitive Whole Life'.\n\nDEATH BENEFIT ONLY LIFE INSURANCE: \nLife insurance that is payable only upon the death of the person stated in the policy (the 'key employee').\n\nDECREASING TERM LIFE INSURANCE: \nLife insurance coverage in which the face amount of the life insurance policy declines by a predefined amount over a period of time.\n\nDEPOSIT TERM LIFE INSURANCE: \nA life insurance policy in which a premium, deposit, is paid in the first policy year in addition to the regular term insurance premiums required.\n\nThe deposit is left to accumulate at interest for a specific number of years.\n\nAfter that, the policyowner can receive the deposit plus interest or may renew the policy without the insured having to furnish evidence of insurability.\n\nA deposit term life insurance policy can be converted to ordinary life or decreasing term life insurance without evidence of insurability.\n\nIf the policyowner cancels the policy prior to the initial period, the deposit and any interest is forfeited.\n\nIf the insured dies before the policy is converted, the deposit plus the interest is added to the death benefit.\n\nDOUBLE-PROTECTION LIFE: \nA life insurance contract combining Term Life Insurance with Whole Life Insurance.\n\nThe contract's term portion expires after a predefined period.  \n\nIf the insured should die during the stipulated period, then both the term portion and the whole life portion will pay.\n\nIf the insured dies after the stipulated period, then only the whole life portion of the contract pays.\n\nENDOWMENT LIFE INSURANCE: \nLife insurance in which an insured receives the face value of a policy should the individual survive the endowment period.\n\nIf the insured does not survive, a beneficiary receives the face value of the policy.\n\nAn endowment policy provides benefits in one of two ways:\n\n(1)  A death benefit to the beneficiary(s) if the insured dies within a specified period (the 'endowment period').\n\n(2)  A living benefit to the policyholder if the insured is still alive at the end of the endowment period when the policy has fully matured.\n\nTypes of Endowment Life Insurance Policies:\n\n- 10-year Endowment\n\n- 20-year Endowment\n\n- 25-year Endowment\n\n- 30-year Endowment\n\n- Endowment at Age 55\n\n- Endowment at Age 60\n\n- Endowment at Age 65\n\n- 20-Pay Endowment at Age 60\n\n- 20-Pay Endowment at Age 65\n\n- Single Premium Endowment\n\nENHANCED ORDINARY LIFE INSURANCE: \nA modified participating coverage life insurance policy in which the dividends are credited to the policy.   The dividends therefore reduce the premiums below that usually charged for ordinary life insurance.\n\nDividends are used to purchase increments of Paid-up Additions of permanent life insurance.\n\nAs the face value of the policy is reduced, the accumulated paid-up additions are generally sufficient to makeup the difference between the reduced face amount of insurance and the initial face amount of insurance purchased.\n\nThis maintains the Death Benefit at a level at least equal to the original amount of insurance purchased.   Most of these policies guarantee that the death benefit will not fall below the original amount of insurance purchased.\n\nENTITY PLAN: \nA buy-sell agreement used in a partnership in which the partnership agrees to purchase the interest of a deceased or disabled partner.\n\nFAMILY MAINTENANCE INSURANCE: \nA combination of whole life and level term insurance providing income to a beneficiary for a period of time if the insured dies during the period.\n\nAt the end of the income-paying period the beneficiary receives the entire face amount of the policy.\n\nIf the insured dies after the end of the selected period, the beneficiary receives only the face value of the policy.   The remainder of the benefits are the same as under the Family Income Policy.\n\nFAMILY INCOME INSURANCE: \nA life insurance contract combining whole life and decreasing term insurance.\n\nA monthly income is paid to a beneficiary if the insured dies during a predefined period.\n\nAt the end of that period, the full face amount of the policy is also paid to the beneficiary.\n\nIt is designed to provide income for a household while the children are still young.\n\nIf the insured dies after the specified period, only the face amount of the policy is paid.\n\nFIRST-TO-DIE LIFE INSURANCE: \nThe same as Joint Life Insurance.\n\nLife insurance coverage of two or more individuals with the death benefit payable at the first death.\n\nFLEXIBLE ENHANCED ORDINARY LIFE INSURANCE: \nA life insurance policy based upon modified Enhanced Ordinary Life in which there is a combination of dividend purchasing paid-up additions, term life insurance and ordinary life insurance.\n\nThe structure of this life insurance product is such that a minimum face amount of ordinary life insurance must be maintained but the policyowner is not limited in the amount of term life insurance that may be added.\n\nAt any time after issue, the policyowner may increase or decrease the amount of term life insurance as well as increase or decrease the amount of extra premiums paid into the policy.\n\nFLEXIBLE SPENDING ACCOUNT LIFE INSURANCE: \nA life insurance account established by the insurance company specifically for beneficiaries of a life insurance policy in which the beneficiary has the choice of leaving the death benefit on deposit in the account and earning interest or writing checks on the deposited amount.\n\nFRANCHISE LIFE: \nFranchise life is a form of group insurance in which the employees covered are employees of a common employer or a members of a common association or society.    It deviates in that the sponsor is not the master policyholder but rather it serves as the sponsor of the plan and collects premiums from the members. \n\nEach individual is insured under a franchise arrangement and given an individual policy, which remains in force as long as they maintain a valid relationship with the sponsor.\n\nFRATERNAL LIFE INSURANCE: \nGroup life insurance coverage for members of a fraternal association.\n\nThis is usually done on a non-profit basis.\n\nGROUP CREDIT LIFE: \nGroup credit life insurance a type of decreasing term insurance issued by insurance companies to creditors to cover the lives of debtors in the amounts of their respective loans.\n\nIf an insured dies before the loan is repaid, the policy proceeds are paid to the creditor to settle the remaining loan balance.\n\nGROUP PERMANENT LIFE INSURANCE: \nGroup life insurance that approximates the structure of group term life insurance.\n\nHowever, premiums go toward the purchase of permanent insurance instead of term insurance.\n\nThe employee has a vested interest in the increments of paid-up insurance purchased.\n\nGroup permanent life insurance is usually used to fund retirement plans because of the tax benefits.   If the employer purchased permanent insurance on the employee's behalf, the contributions would become taxable income to the employee on a current basis.\n\nGROUP TERM LIFE INSURANCE: \nOne year life insurance coverage that is renewable at the end of the year.\n\nThe premium rate upon renewal is based on loss record of the group and employees ages.\n\nAll employees are insured with term life insurance.\n\nThe employee usually not convert group term to individual permanent insurance because the conversion is at a higher attained age rate.\n\nGROUP UNIVERSAL LIFE INSURANCE: \nA contract between the policy holder and the insurer, where the insurer promises to pay a designated beneficiary a sum of money (premium) upon the death of the insured person.\n\nGUARANTEED COST NONPARTICIPATING LIFE INSURANCE: \nA life insurance policy whose premiums, cash value and face amount are all guaranteed.\n\nIt is nonparticipating, so the policyowner does not share with the insurance company when the insurance company experiences good financial fortunes.  \n\nConversely, the policyowner does not share negative financial results either.\n\nINDEXED LIFE INSURANCE: \nA life insurance policy with a face value that varies according to a prescribed index of prices.\n\nOther benefits are similar to ordinary whole life.\n\nThe death benefit is based on the particular index used.   The policyowner has the choice of having the index applied either automatically or on an elective basis.\n\nWith the automatic index increase, the premium remains level.\n\nWith the optional index increase, an extra premium is charged when this option is exercised.\n\nThe death benefit as it increases does not require another physical examination or evidence of insurability.\n\nINDUSTRIAL LIFE INSURANCE: \nA life insurance policy consisting of modest face values sold on a debit basis.\n\nIRREVOCABLE LIFE INSURANCE TRUST: \nAn estate planning device used so that any life insurance policies owned by and paid to the Trust will avoid Estate Tax upon the death of the insured.\n\nEstate taxes will be avoided as well.\n\nRequirements are that the trust must irrevocable and no distributions of the trust's principle or income may be made to the insured.   All income generated by the trust must be accumulated and distributed with the trust's principal to the trust's beneficiary.\n\nJOINT LIFE AND SURVIVOR INSURANCE: \nInsurance coverage for two or more individuals with the death benefit payable at the death of the last of those insured.\n\nPremiums are significantly lower for this type of insurance since the probability of having to pay a death claim is lower.\n\nJOINT LIFE INSURANCE: \nLife insurance coverage of two or more individuals with the death benefit payable at the first death.\n\nJUVENILE INSURANCE: \nLife insurance that is written on the lives of children.\n\nApplication for insurance and ownership of the insurance policy rests with an adult such as a parent or guardian.\n\nStates normally limit the amount of life insurance that can be written on a child at the early ages by defining a maximum that can be in force at various ages.\n\nKEY EMPLOYEES LIFE INSURANCE: \nInsurance on the life of a key employee for whom the loss of their services would cause a financial loss to the employer.   \n\nThe policy is owned by and payable to the employer.\n\nLEVERAGED SPLIT DOLLAR LIFE INSURANCE: \nLife insurance that is modified collateral Split Dollar Life Insurance in which the employee purchases and owns a life insurance policy on their own life.\n\nThe employee makes a collateral assignment of the policy to the employer, which acts as security for the unscheduled premiums paid by the employer.\n\nUpon this assignment, the life insurance company issuing the policy lends the employer the amount of the unscheduled premium payment.   Interest paid to the insurance company by the employer for the loan is tax-deductible to the employer.\n\nPart of the interest paid by the employer is credited to the cash value of the policy by the insurance company.   During this period, the employer also makes scheduled premium payments.\n\nThe scheduled premium payments are taxed as ordinary current income to the employee.   When the employee retires, the split dollar plan is terminated and all of the unscheduled premium payments made by the employer are repaid to the employee as either loans on the cash value of the policy or as cash withdrawals from the policy.\n\nWith the repaid premiums amount, the employer may then repay the insurance company for the previous loans to pay the unscheduled premium payments.  The repaid loan amount is credited to the cash value of the policy by the insurance company.\n\nThe employee borrows a series of annual income payments based on the employee's life expectancy from the reconstituted cash values.   When the employee dies, the Death Benefit from the policy repays the amount owed the insurance company for the loans from the cash value made to fund the retirement income of the employee.   \n\nThe excess amount of the death benefit minus the policy loan repayment is paid to the employee's beneficiary.\n\nLIMITED PAYMENT LIFE INSURANCE: \nA type of life insurance policy in which premiums are fully paid up with a predefined period and no additional premiums are paid.\n\nMULTIPLE EMPLOYER TRUST (MET): \nA method of marketing group benefits to employers with a small number of employees.\n\nAn employer who wants to get coverage for employees from a MET must first become a member of the trust by subscribing to it.   The employer is issued a joinder agreement defining the relationship between the trust and the employer and specifying the coverages to which the employer has subscribed.\n\nA MET may be self-funded or fund benefits with a contract purchased from an insurance company.\n\nMULTIPLE PROTECTION LIFE INSURANCE: \nA single life insurance policy that combines Term Life Insurance and Ordinary Life Insurance.   \n\nIf the insured dies during the term period, a multiple of the face amount is paid to the beneficiary.\n\nIf the insured dies after the term period has expired, only the face amount is paid to the beneficiary.\n\nPARTNERSHIP LIFE INSURANCE: \nLife insurance sold to a partnership that addresses or guarantees business continuity in case of the death or disability of one of the partners.\n\nEx:\n\nPartners might buy life insurance on each other so that in the event of one partner's death the other can use the insurance proceeds to purchase his share of the business from his heirs.\n\nPERMANENT LIFE INSURANCE: \nA term loosely applied to life insurance policy forms other than Group and Term, usually Cash Value Life Insurance such as Whole or Ordinary Life policies or endowments.\n\nPURE ENDOWMENT: \nA life insurance policy in which its face value is payable only if the insured survive to the end of the predefined endowment period.\n\nNo benefit is paid if the insured dies during the endowment period.\n\nRE-ENTRY TERM LIFE INSURANCE: \nYearly renewable term life insurance in which an insured can apply for term insurance every fifth year at a lower premium than the guaranteed renewal rate.\n\nIf the insured's health is good, the guaranteed renewable term premium can be reduced.\n\nOtherwise, the guaranteed rate must be continued to be paid on renewal.\n\nRENEWABLE TERM LIFE INSURANCE: \nRenewable life insurance that is renewable at the option of the insured. \n\nThe insured is not required to take a medical examination.\n\nRegardless of physical condition, the insured must be allowed to renew the policy and the premium cannot be increased to reflect any adverse physical condition.\n\nThe premium is however adjusted at each renewal to reflect the life expectancy of the insured at that age.\n\nREVERSE SPLIT DOLLAR LIFE INSURANCE: \nA life insurance policy that is the opposite of the traditional Split Dollar Life Insurance policy in that:\n\nSAVINGS BANK LIFE INSURANCE: \nLow cost life insurance policies sold by savings banks in Connecticut, Massachusetts and New York.  Maximum policy amounts are limited by state law.\n\nSPLIT DOLLAR COLLATERAL LIFE INSURANCE: \nSplit Dollar Collateral - in which the employee owns the policy.  The employee pays premium contributions, which are viewed as a series of interest-free loans, equal to the yearly increase in the cash value of the policy.   The employee assigns the policy to the employer as collateral for these loans.   When the employee dies, then the loans are paid from the face value of the policy.  The beneficiary receives and remaining proceeds.\n\nSPLIT DOLLAR ENDOWMENT LIFE INSURANCE: \nSplit Dollar Endowment - in which the employer owns all policy privileges.   The employees only rights are to choose beneficiaries and to select the manner in which the death benefit is paid.\n\nSPLIT DOLLAR LIFE INSURANCE: \nA life insurance policy in which premiums, ownership rights and death benefits are split between an employer and the employee, or between a child and parent.\n\nThe employer pays the part of each years premium that at least equals the increase in the cash value.  The employee may pay the remainder of the premium or the employer may pay the entire premium.\n\nWhen the increase in cash value equals or exceeds the yearly premium, the employer pays the entire premium.   \n\nIf the employee dies while in the service of the employer, a beneficiary chosen by the employee then receives the difference between the face value and the amount paid to the employer, whichever is greater.\n\nDuring employment, the employee share of the death benefit decreases.   If the employee leaves the employer, the employer has the option of surrendering the policy to the employee in exchange for premiums paid or selling the policy to the employee for the amount of its cash value.\n\nThere are two types of Split Dollar Life Insurance Policies:\n\n(1) Split Dollar Endowment - in which the employer owns all policy privileges.   The employees only rights are to choose beneficiaries and to select the manner in which the death benefit is paid.\n\n(2) Split Dollar Collateral - in which the employee owns the policy.  The employee pays premium contributions, which are viewed as a series of interest-free loans, equal to the yearly increase in the cash value of the policy.   The employee assigns the policy to the employer as collateral for these loans.   When the employee dies, then the loans are paid from the face value of the policy.  The beneficiary receives and remaining proceeds.\n\nSPLIT LIFE INSURANCE:\nLine insurance that is a combination of Term Life Insurance and an Installment Refund Annuity.\n\nSURVIVORSHIP LIFE INSURANCE:\nA life insurance policy in which more than one person pays a benefit after all of the insureds have died.  \n\nThis is a type of Joint Life Policy that is cheaper than a regular policy.\n\nThis type of life insurance may be used to fund estate taxes after the deaths of the husband and wife or as form of business continuation insurance.\n\nUNIVERSAL VARIABLE LIFE INSURANCE:\nA life insurance policy that combines the features of Universal Life Insurance and Variable Life Insurance in that the excess interest that is credited to the cash value account depends on the investment results of separate accounts.\n\nThe policyholder selects that accounts (stocks, bonds etc.) into which premiums are to be invested.\n\nThis is an equity product that requires SEC, annual prospectus and account audits.\n\nVARIABLE LIFE INSURANCE:\nWhole life insurance that is investment-oriented providing a return that is linked to an underlying portfolio of stocks.  \n\nThe portfolio is typically a group of mutual funds defined by the insurer as a separate account.\n\nThe policyholder is given some discretion in choosing the asset mix.\n\nThis type of insurance offers fixed premiums and a minimum death benefit.\n\nThe better the total return on the portfolio, the higher the death benefit or surrender value of the life policy.\n\nVARIABLE PREMIUM LIFE INSURANCE:\nA life insurance policy allowing premium payments to vary within certain parameters at the policyholder's option.\n\nIn return, the death benefit and rate of cash value accumulation varies with the premium payments.",
		"TableType": "EXTERNAL",
		"Origin": {
			"Type": "SPARK"
		},
		"StorageDescriptor": {
			"Columns": [
				{
					"Name": "ProductId",
					"Description": "The unique identifier of a Product.",
					"BaseAttributeReference": {
						"Entity": "OtherLifeInsurance.cdm.json/OtherLifeInsurance",
						"Name": "ProductId"
					},
					"OriginDataTypeName": {
						"TypeName": "long",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "long"
						}
					}
				}
			],
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"ProductId\":{\"entity\":\"OtherLifeInsurance.cdm.json/OtherLifeInsurance\",\"name\":\"ProductId\"}}}"
			},
			"Compressed": false,
			"IsStoredAsSubdirectories": false
		},
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"OtherLifeInsurance\",\"path\":\"OtherLifeInsurance.cdm.json/OtherLifeInsurance\"},\"description\":\"There are many other types of life insurance product types. Some of these are briefly described below.\\n\\nEx.:\\n- ACCELERATION LIFE INSURANCE\\n- ACCELERATIVE ENDOWMENT LIFE INSURANCE\\n- ADJUSTABLE LIFE INSURANCE\\n- AVIATION TRIP LIFE INSURANCE\\n- BLANKET LIFE\\n- CASH VALUE LIFE INSURANCE\\n- CHARITABLE GIFT LIFE INSURANCE\\n- CONTINUOUS PREMIUM WHOLE LIFE INSURANCE\\n- CONVERTIBLE TERM LIFE INSURANCE\\n- CREDIT LIFE INSURANCE\\n- CROSS PURCHASE PLAN\\n- CURRENT ASSUMPTION WHOLE LIFE INSURANCE\\n- DEATH BENEFIT ONLY LIFE INSURANCE\\n- DECREASING TERM LIFE INSURANCE\\n- DEPOSIT TERM LIFE INSURANCE\\n- DOUBLE-PROTECTION LIFE\\n- ENDOWMENT LIFE INSURANCE\\n- ENHANCED ORDINARY LIFE INSURANCE\\n- ENTITY PLAN\\n- FAMILY MAINTENANCE INSURANCE\\n- FAMILY INCOME INSURANCE\\n- FIRST-TO-DIE LIFE INSURANCE\\n- FLEXIBLE ENHANCED ORDINARY LIFE INSURANCE\\n- FLEXIBLE SPENDING ACCOUNT LIFE INSURANCE\\n- FRANCHISE LIFE\\n- FRATERNAL LIFE INSURANCE\\n- GROUP CREDIT LIFE\\n- GROUP PERMANENT LIFE INSURANCE\\n- GROUP TERM LIFE INSURANCE\\n- GROUP UNIVERSAL LIFE INSURANCE\\n- GUARANTEED COST NONPARTICIPATING LIFE INSURANCE\\n- INDEXED LIFE INSURANCE\\n- INDUSTRIAL LIFE INSURANCE\\n- IRREVOCABLE LIFE INSURANCE TRUST\\n- JOINT LIFE AND SURVIVOR INSURANCE\\n- JOINT LIFE INSURANCE\\n- JUVENILE INSURANCE\\n- KEY EMPLOYEES LIFE INSURANCE\\n- LEVERAGED SPLIT DOLLAR LIFE INSURANCE\\n- LIMITED PAYMENT LIFE INSURANCE\\n- MULTIPLE EMPLOYER TRUST (MET)\\n- MULTIPLE PROTECTION LIFE INSURANCE\\n- PARTNERSHIP LIFE INSURANCE\\n- PERMANENT LIFE INSURANCE\\n- PURE ENDOWMENT\\n- RE-ENTRY TERM LIFE INSURANCE\\n- RENEWABLE TERM LIFE INSURANCE\\n- REVERSE SPLIT DOLLAR LIFE INSURANCE\\n- SAVINGS BANK LIFE INSURANCE\\n- SPLIT DOLLAR COLLATERAL LIFE INSURANCE\\n- SPLIT DOLLAR ENDOWMENT LIFE INSURANCE\\n- SPLIT DOLLAR LIFE INSURANCE\\n- SPLIT LIFE INSURANCE\\n- SURVIVORSHIP LIFE INSURANCE\\n- UNIVERSAL VARIABLE LIFE INSURANCE\\n- VARIABLE LIFE INSURANCE\\n- VARIABLE PREMIUM LIFE INSURANCE\\n\\nwhere:\\n\\nACCELERATION LIFE INSURANCE: \\nA type of life insurance policy in which a portion of the Death Benefit is payable to the insured for a pre-specified medical condition prior to death.\\n\\nThe intent of the accelerated death benefit is to provide the money required to finance medical costs to improve or extend the life of the insured.   \\n\\nWhen presented with proof that the specified medical condition exists, the insurance company will pay the percentage of the death benefit to the insured.  \\n\\nThe remainder of the death benefit is paid to the beneficiary upon the death of the insured as in a traditional life insurance policy.\\n\\nACCELERATIVE ENDOWMENT LIFE INSURANCE: \\nA type life Insurance policy in which the dividends that accrue are applied to the matured policy as endowment insurance.\\n\\nADJUSTABLE LIFE INSURANCE: \\nLife insurance coverage in which several policy components may be changed or modified at the discretion of the policyowner without writing issuing additional policies.\\n\\nThe components that can be changed are typically:\\n\\n(1)  The face value of the policy can be increased or decreased.    The cash value will be reflected in the amount of the face value and premium.\\n\\n(2)  Premiums and the premiums payment schedule can be increased or decreased.\\n\\nUnscheduled premiums can be paid in a single lump-sum amount.\\n\\nAVIATION TRIP LIFE INSURANCE: \\nTerm life insurance that provides a death payment to the passenger's beneficiary in the event of a fatal aviation accident.  \\n\\nTypically the insurance is purchased at an airport by the passenger.\\n\\nThe term of the coverage is normally from the time that the passenger enters the airplane until the time that he departs the airplane.     Sometimes ground transportation to and from the airport is covered.\\n\\nBLANKET LIFE: \\nBlanket life insurance covers a group of people exposed to a common hazard.\\n\\nIndividuals do not need to apply for blanket coverage and insurers do not need to provide each person with a certificate of coverage.   Insured parties are also not specifically named in the policy because it is temporary coverage.\\n\\nAn example is a policy issued to the owner of an airline to cover passengers.\\n\\nCASH VALUE LIFE INSURANCE: \\nA life insurance policy that incorporates a savings element.   \\n\\nThe size of the cash value depends on the cash value amount and the age of the policy owner\\n\\nThe policyowner has options based upon the cash value to convert to a monthly retirement income.\\n\\nThe size of the cash value accumulating differs from company to company.\\n\\nCHARITABLE GIFT LIFE INSURANCE: \\nAn annuity donation made by a donor to a charity.\\n\\nThe charity agrees to pay the donor an amount of the rest of the donor's life.\\n\\nThe donation is used to fund an annuity, only a percentage of the donation can be taken as a tax deductible gift in the year of the donation.\\n\\nThe donor is dependent on the charity to make income payments and therefore should ascertain the ability of the charity to maintain those payments.\\n\\nThis annuity permits the donor to transfer appreciated property to a charitable organization in exchange for the promise by the organization to pay a continuous stream of income through his life.\\n\\nCONTINUOUS PREMIUM WHOLE LIFE INSURANCE: \\nA life insurance policy that remains in effect for the life of the insured with premiums made for the same period.\\n\\nCONVERTIBLE TERM LIFE INSURANCE: \\nLife insurance that can be converted into permanent life insurance regardless of an insured's physical condition and without a medical examination.\\n\\nThe individual cannot be denied covered or charged additional premiums for health problems.\\n\\nCREDIT LIFE INSURANCE: \\nLife insurance that is designed to cover the life of a debtor and pay an amount due on a loan if the debtor dies before the loan is repaid.\\n\\nThis insurance is decreasing term where the term matches the length of the loan period and the decreasing insurance amount matched to the declining loan balance.\\n\\nCROSS PURCHASE PLAN: \\nA binding buy-sell agreement used in partnerships in which each partner agrees to purchase the business interest of a deceased or disabled partner.\\n\\nCURRENT ASSUMPTION WHOLE LIFE INSURANCE: \\nA life insurance policy that is a variation of Ordinary Life Insurance in which the mortality experience and investment earnings are credited to the insurance policy either through the cash value account and/or premium structure or the dividend structure.\\n\\nThe policy is characterized by:\\n\\n(1)  Premiums subject to change.  \\n\\n These are not controlled by the insurance company, not the policyowner.\\n\\n(2)  The policyowner can use the cash value to make loans.\\n\\n(3)  A minimum amount of cash value is guaranteed\\n\\n(4)  The death benefit does not fluctuate\\n\\nThis type of insurance is also known as 'Interest-Sensitive Whole Life'.\\n\\nDEATH BENEFIT ONLY LIFE INSURANCE: \\nLife insurance that is payable only upon the death of the person stated in the policy (the 'key employee').\\n\\nDECREASING TERM LIFE INSURANCE: \\nLife insurance coverage in which the face amount of the life insurance policy declines by a predefined amount over a period of time.\\n\\nDEPOSIT TERM LIFE INSURANCE: \\nA life insurance policy in which a premium, deposit, is paid in the first policy year in addition to the regular term insurance premiums required.\\n\\nThe deposit is left to accumulate at interest for a specific number of years.\\n\\nAfter that, the policyowner can receive the deposit plus interest or may renew the policy without the insured having to furnish evidence of insurability.\\n\\nA deposit term life insurance policy can be converted to ordinary life or decreasing term life insurance without evidence of insurability.\\n\\nIf the policyowner cancels the policy prior to the initial period, the deposit and any interest is forfeited.\\n\\nIf the insured dies before the policy is converted, the deposit plus the interest is added to the death benefit.\\n\\nDOUBLE-PROTECTION LIFE: \\nA life insurance contract combining Term Life Insurance with Whole Life Insurance.\\n\\nThe contract's term portion expires after a predefined period.  \\n\\nIf the insured should die during the stipulated period, then both the term portion and the whole life portion will pay.\\n\\nIf the insured dies after the stipulated period, then only the whole life portion of the contract pays.\\n\\nENDOWMENT LIFE INSURANCE: \\nLife insurance in which an insured receives the face value of a policy should the individual survive the endowment period.\\n\\nIf the insured does not survive, a beneficiary receives the face value of the policy.\\n\\nAn endowment policy provides benefits in one of two ways:\\n\\n(1)  A death benefit to the beneficiary(s) if the insured dies within a specified period (the 'endowment period').\\n\\n(2)  A living benefit to the policyholder if the insured is still alive at the end of the endowment period when the policy has fully matured.\\n\\nTypes of Endowment Life Insurance Policies:\\n\\n- 10-year Endowment\\n\\n- 20-year Endowment\\n\\n- 25-year Endowment\\n\\n- 30-year Endowment\\n\\n- Endowment at Age 55\\n\\n- Endowment at Age 60\\n\\n- Endowment at Age 65\\n\\n- 20-Pay Endowment at Age 60\\n\\n- 20-Pay Endowment at Age 65\\n\\n- Single Premium Endowment\\n\\nENHANCED ORDINARY LIFE INSURANCE: \\nA modified participating coverage life insurance policy in which the dividends are credited to the policy.   The dividends therefore reduce the premiums below that usually charged for ordinary life insurance.\\n\\nDividends are used to purchase increments of Paid-up Additions of permanent life insurance.\\n\\nAs the face value of the policy is reduced, the accumulated paid-up additions are generally sufficient to makeup the difference between the reduced face amount of insurance and the initial face amount of insurance purchased.\\n\\nThis maintains the Death Benefit at a level at least equal to the original amount of insurance purchased.   Most of these policies guarantee that the death benefit will not fall below the original amount of insurance purchased.\\n\\nENTITY PLAN: \\nA buy-sell agreement used in a partnership in which the partnership agrees to purchase the interest of a deceased or disabled partner.\\n\\nFAMILY MAINTENANCE INSURANCE: \\nA combination of whole life and level term insurance providing income to a beneficiary for a period of time if the insured dies during the period.\\n\\nAt the end of the income-paying period the beneficiary receives the entire face amount of the policy.\\n\\nIf the insured dies after the end of the selected period, the beneficiary receives only the face value of the policy.   The remainder of the benefits are the same as under the Family Income Policy.\\n\\nFAMILY INCOME INSURANCE: \\nA life insurance contract combining whole life and decreasing term insurance.\\n\\nA monthly income is paid to a beneficiary if the insured dies during a predefined period.\\n\\nAt the end of that period, the full face amount of the policy is also paid to the beneficiary.\\n\\nIt is designed to provide income for a household while the children are still young.\\n\\nIf the insured dies after the specified period, only the face amount of the policy is paid.\\n\\nFIRST-TO-DIE LIFE INSURANCE: \\nThe same as Joint Life Insurance.\\n\\nLife insurance coverage of two or more individuals with the death benefit payable at the first death.\\n\\nFLEXIBLE ENHANCED ORDINARY LIFE INSURANCE: \\nA life insurance policy based upon modified Enhanced Ordinary Life in which there is a combination of dividend purchasing paid-up additions, term life insurance and ordinary life insurance.\\n\\nThe structure of this life insurance product is such that a minimum face amount of ordinary life insurance must be maintained but the policyowner is not limited in the amount of term life insurance that may be added.\\n\\nAt any time after issue, the policyowner may increase or decrease the amount of term life insurance as well as increase or decrease the amount of extra premiums paid into the policy.\\n\\nFLEXIBLE SPENDING ACCOUNT LIFE INSURANCE: \\nA life insurance account established by the insurance company specifically for beneficiaries of a life insurance policy in which the beneficiary has the choice of leaving the death benefit on deposit in the account and earning interest or writing checks on the deposited amount.\\n\\nFRANCHISE LIFE: \\nFranchise life is a form of group insurance in which the employees covered are employees of a common employer or a members of a common association or society.    It deviates in that the sponsor is not the master policyholder but rather it serves as the sponsor of the plan and collects premiums from the members. \\n\\nEach individual is insured under a franchise arrangement and given an individual policy, which remains in force as long as they maintain a valid relationship with the sponsor.\\n\\nFRATERNAL LIFE INSURANCE: \\nGroup life insurance coverage for members of a fraternal association.\\n\\nThis is usually done on a non-profit basis.\\n\\nGROUP CREDIT LIFE: \\nGroup credit life insurance a type of decreasing term insurance issued by insurance companies to creditors to cover the lives of debtors in the amounts of their respective loans.\\n\\nIf an insured dies before the loan is repaid, the policy proceeds are paid to the creditor to settle the remaining loan balance.\\n\\nGROUP PERMANENT LIFE INSURANCE: \\nGroup life insurance that approximates the structure of group term life insurance.\\n\\nHowever, premiums go toward the purchase of permanent insurance instead of term insurance.\\n\\nThe employee has a vested interest in the increments of paid-up insurance purchased.\\n\\nGroup permanent life insurance is usually used to fund retirement plans because of the tax benefits.   If the employer purchased permanent insurance on the employee's behalf, the contributions would become taxable income to the employee on a current basis.\\n\\nGROUP TERM LIFE INSURANCE: \\nOne year life insurance coverage that is renewable at the end of the year.\\n\\nThe premium rate upon renewal is based on loss record of the group and employees ages.\\n\\nAll employees are insured with term life insurance.\\n\\nThe employee usually not convert group term to individual permanent insurance because the conversion is at a higher attained age rate.\\n\\nGROUP UNIVERSAL LIFE INSURANCE: \\nA contract between the policy holder and the insurer, where the insurer promises to pay a designated beneficiary a sum of money (premium) upon the death of the insured person.\\n\\nGUARANTEED COST NONPARTICIPATING LIFE INSURANCE: \\nA life insurance policy whose premiums, cash value and face amount are all guaranteed.\\n\\nIt is nonparticipating, so the policyowner does not share with the insurance company when the insurance company experiences good financial fortunes.  \\n\\nConversely, the policyowner does not share negative financial results either.\\n\\nINDEXED LIFE INSURANCE: \\nA life insurance policy with a face value that varies according to a prescribed index of prices.\\n\\nOther benefits are similar to ordinary whole life.\\n\\nThe death benefit is based on the particular index used.   The policyowner has the choice of having the index applied either automatically or on an elective basis.\\n\\nWith the automatic index increase, the premium remains level.\\n\\nWith the optional index increase, an extra premium is charged when this option is exercised.\\n\\nThe death benefit as it increases does not require another physical examination or evidence of insurability.\\n\\nINDUSTRIAL LIFE INSURANCE: \\nA life insurance policy consisting of modest face values sold on a debit basis.\\n\\nIRREVOCABLE LIFE INSURANCE TRUST: \\nAn estate planning device used so that any life insurance policies owned by and paid to the Trust will avoid Estate Tax upon the death of the insured.\\n\\nEstate taxes will be avoided as well.\\n\\nRequirements are that the trust must irrevocable and no distributions of the trust's principle or income may be made to the insured.   All income generated by the trust must be accumulated and distributed with the trust's principal to the trust's beneficiary.\\n\\nJOINT LIFE AND SURVIVOR INSURANCE: \\nInsurance coverage for two or more individuals with the death benefit payable at the death of the last of those insured.\\n\\nPremiums are significantly lower for this type of insurance since the probability of having to pay a death claim is lower.\\n\\nJOINT LIFE INSURANCE: \\nLife insurance coverage of two or more individuals with the death benefit payable at the first death.\\n\\nJUVENILE INSURANCE: \\nLife insurance that is written on the lives of children.\\n\\nApplication for insurance and ownership of the insurance policy rests with an adult such as a parent or guardian.\\n\\nStates normally limit the amount of life insurance that can be written on a child at the early ages by defining a maximum that can be in force at various ages.\\n\\nKEY EMPLOYEES LIFE INSURANCE: \\nInsurance on the life of a key employee for whom the loss of their services would cause a financial loss to the employer.   \\n\\nThe policy is owned by and payable to the employer.\\n\\nLEVERAGED SPLIT DOLLAR LIFE INSURANCE: \\nLife insurance that is modified collateral Split Dollar Life Insurance in which the employee purchases and owns a life insurance policy on their own life.\\n\\nThe employee makes a collateral assignment of the policy to the employer, which acts as security for the unscheduled premiums paid by the employer.\\n\\nUpon this assignment, the life insurance company issuing the policy lends the employer the amount of the unscheduled premium payment.   Interest paid to the insurance company by the employer for the loan is tax-deductible to the employer.\\n\\nPart of the interest paid by the employer is credited to the cash value of the policy by the insurance company.   During this period, the employer also makes scheduled premium payments.\\n\\nThe scheduled premium payments are taxed as ordinary current income to the employee.   When the employee retires, the split dollar plan is terminated and all of the unscheduled premium payments made by the employer are repaid to the employee as either loans on the cash value of the policy or as cash withdrawals from the policy.\\n\\nWith the repaid premiums amount, the employer may then repay the insurance company for the previous loans to pay the unscheduled premium payments.  The repaid loan amount is credited to the cash value of the policy by the insurance company.\\n\\nThe employee borrows a series of annual income payments based on the employee's life expectancy from the reconstituted cash values.   When the employee dies, the Death Benefit from the policy repays the amount owed the insurance company for the loans from the cash value made to fund the retirement income of the employee.   \\n\\nThe excess amount of the death benefit minus the policy loan repayment is paid to the employee's beneficiary.\\n\\nLIMITED PAYMENT LIFE INSURANCE: \\nA type of life insurance policy in which premiums are fully paid up with a predefined period and no additional premiums are paid.\\n\\nMULTIPLE EMPLOYER TRUST (MET): \\nA method of marketing group benefits to employers with a small number of employees.\\n\\nAn employer who wants to get coverage for employees from a MET must first become a member of the trust by subscribing to it.   The employer is issued a joinder agreement defining the relationship between the trust and the employer and specifying the coverages to which the employer has subscribed.\\n\\nA MET may be self-funded or fund benefits with a contract purchased from an insurance company.\\n\\nMULTIPLE PROTECTION LIFE INSURANCE: \\nA single life insurance policy that combines Term Life Insurance and Ordinary Life Insurance.   \\n\\nIf the insured dies during the term period, a multiple of the face amount is paid to the beneficiary.\\n\\nIf the insured dies after the term period has expired, only the face amount is paid to the beneficiary.\\n\\nPARTNERSHIP LIFE INSURANCE: \\nLife insurance sold to a partnership that addresses or guarantees business continuity in case of the death or disability of one of the partners.\\n\\nEx:\\n\\nPartners might buy life insurance on each other so that in the event of one partner's death the other can use the insurance proceeds to purchase his share of the business from his heirs.\\n\\nPERMANENT LIFE INSURANCE: \\nA term loosely applied to life insurance policy forms other than Group and Term, usually Cash Value Life Insurance such as Whole or Ordinary Life policies or endowments.\\n\\nPURE ENDOWMENT: \\nA life insurance policy in which its face value is payable only if the insured survive to the end of the predefined endowment period.\\n\\nNo benefit is paid if the insured dies during the endowment period.\\n\\nRE-ENTRY TERM LIFE INSURANCE: \\nYearly renewable term life insurance in which an insured can apply for term insurance every fifth year at a lower premium than the guaranteed renewal rate.\\n\\nIf the insured's health is good, the guaranteed renewable term premium can be reduced.\\n\\nOtherwise, the guaranteed rate must be continued to be paid on renewal.\\n\\nRENEWABLE TERM LIFE INSURANCE: \\nRenewable life insurance that is renewable at the option of the insured. \\n\\nThe insured is not required to take a medical examination.\\n\\nRegardless of physical condition, the insured must be allowed to renew the policy and the premium cannot be increased to reflect any adverse physical condition.\\n\\nThe premium is however adjusted at each renewal to reflect the life expectancy of the insured at that age.\\n\\nREVERSE SPLIT DOLLAR LIFE INSURANCE: \\nA life insurance policy that is the opposite of the traditional Split Dollar Life Insurance policy in that:\\n\\nSAVINGS BANK LIFE INSURANCE: \\nLow cost life insurance policies sold by savings banks in Connecticut, Massachusetts and New York.  Maximum policy amounts are limited by state law.\\n\\nSPLIT DOLLAR COLLATERAL LIFE INSURANCE: \\nSplit Dollar Collateral - in which the employee owns the policy.  The employee pays premium contributions, which are viewed as a series of interest-free loans, equal to the yearly increase in the cash value of the policy.   The employee assigns the policy to the employer as collateral for these loans.   When the employee dies, then the loans are paid from the face value of the policy.  The beneficiary receives and remaining proceeds.\\n\\nSPLIT DOLLAR ENDOWMENT LIFE INSURANCE: \\nSplit Dollar Endowment - in which the employer owns all policy privileges.   The employees only rights are to choose beneficiaries and to select the manner in which the death benefit is paid.\\n\\nSPLIT DOLLAR LIFE INSURANCE: \\nA life insurance policy in which premiums, ownership rights and death benefits are split between an employer and the employee, or between a child and parent.\\n\\nThe employer pays the part of each years premium that at least equals the increase in the cash value.  The employee may pay the remainder of the premium or the employer may pay the entire premium.\\n\\nWhen the increase in cash value equals or exceeds the yearly premium, the employer pays the entire premium.   \\n\\nIf the employee dies while in the service of the employer, a beneficiary chosen by the employee then receives the difference between the face value and the amount paid to the employer, whichever is greater.\\n\\nDuring employment, the employee share of the death benefit decreases.   If the employee leaves the employer, the employer has the option of surrendering the policy to the employee in exchange for premiums paid or selling the policy to the employee for the amount of its cash value.\\n\\nThere are two types of Split Dollar Life Insurance Policies:\\n\\n(1) Split Dollar Endowment - in which the employer owns all policy privileges.   The employees only rights are to choose beneficiaries and to select the manner in which the death benefit is paid.\\n\\n(2) Split Dollar Collateral - in which the employee owns the policy.  The employee pays premium contributions, which are viewed as a series of interest-free loans, equal to the yearly increase in the cash value of the policy.   The employee assigns the policy to the employer as collateral for these loans.   When the employee dies, then the loans are paid from the face value of the policy.  The beneficiary receives and remaining proceeds.\\n\\nSPLIT LIFE INSURANCE:\\nLine insurance that is a combination of Term Life Insurance and an Installment Refund Annuity.\\n\\nSURVIVORSHIP LIFE INSURANCE:\\nA life insurance policy in which more than one person pays a benefit after all of the insureds have died.  \\n\\nThis is a type of Joint Life Policy that is cheaper than a regular policy.\\n\\nThis type of life insurance may be used to fund estate taxes after the deaths of the husband and wife or as form of business continuation insurance.\\n\\nUNIVERSAL VARIABLE LIFE INSURANCE:\\nA life insurance policy that combines the features of Universal Life Insurance and Variable Life Insurance in that the excess interest that is credited to the cash value account depends on the investment results of separate accounts.\\n\\nThe policyholder selects that accounts (stocks, bonds etc.) into which premiums are to be invested.\\n\\nThis is an equity product that requires SEC, annual prospectus and account audits.\\n\\nVARIABLE LIFE INSURANCE:\\nWhole life insurance that is investment-oriented providing a return that is linked to an underlying portfolio of stocks.  \\n\\nThe portfolio is typically a group of mutual funds defined by the insurer as a separate account.\\n\\nThe policyholder is given some discretion in choosing the asset mix.\\n\\nThis type of insurance offers fixed premiums and a minimum death benefit.\\n\\nThe better the total return on the portfolio, the higher the death benefit or surrender value of the life policy.\\n\\nVARIABLE PREMIUM LIFE INSURANCE:\\nA life insurance policy allowing premium payments to vary within certain parameters at the policyholder's option.\\n\\nIn return, the death benefit and rate of cash value accumulation varies with the premium payments.\",\"primaryKey\":[\"ProductId\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OtherLifeInsurance.cdm.json/OtherLifeInsurance\",\"name\":\"ProductId\"},\"dataType\":\"long\",\"description\":\"The unique identifier of a Product.\",\"isNullable\":false,\"name\":\"ProductId\"}]}}}",
			"Description": "There are many other types of life insurance product types. Some of these are briefly described below.\n\nEx.:\n- ACCELERATION LIFE INSURANCE\n- ACCELERATIVE ENDOWMENT LIFE INSURANCE\n- ADJUSTABLE LIFE INSURANCE\n- AVIATION TRIP LIFE INSURANCE\n- BLANKET LIFE\n- CASH VALUE LIFE INSURANCE\n- CHARITABLE GIFT LIFE INSURANCE\n- CONTINUOUS PREMIUM WHOLE LIFE INSURANCE\n- CONVERTIBLE TERM LIFE INSURANCE\n- CREDIT LIFE INSURANCE\n- CROSS PURCHASE PLAN\n- CURRENT ASSUMPTION WHOLE LIFE INSURANCE\n- DEATH BENEFIT ONLY LIFE INSURANCE\n- DECREASING TERM LIFE INSURANCE\n- DEPOSIT TERM LIFE INSURANCE\n- DOUBLE-PROTECTION LIFE\n- ENDOWMENT LIFE INSURANCE\n- ENHANCED ORDINARY LIFE INSURANCE\n- ENTITY PLAN\n- FAMILY MAINTENANCE INSURANCE\n- FAMILY INCOME INSURANCE\n- FIRST-TO-DIE LIFE INSURANCE\n- FLEXIBLE ENHANCED ORDINARY LIFE INSURANCE\n- FLEXIBLE SPENDING ACCOUNT LIFE INSURANCE\n- FRANCHISE LIFE\n- FRATERNAL LIFE INSURANCE\n- GROUP CREDIT LIFE\n- GROUP PERMANENT LIFE INSURANCE\n- GROUP TERM LIFE INSURANCE\n- GROUP UNIVERSAL LIFE INSURANCE\n- GUARANTEED COST NONPARTICIPATING LIFE INSURANCE\n- INDEXED LIFE INSURANCE\n- INDUSTRIAL LIFE INSURANCE\n- IRREVOCABLE LIFE INSURANCE TRUST\n- JOINT LIFE AND SURVIVOR INSURANCE\n- JOINT LIFE INSURANCE\n- JUVENILE INSURANCE\n- KEY EMPLOYEES LIFE INSURANCE\n- LEVERAGED SPLIT DOLLAR LIFE INSURANCE\n- LIMITED PAYMENT LIFE INSURANCE\n- MULTIPLE EMPLOYER TRUST (MET)\n- MULTIPLE PROTECTION LIFE INSURANCE\n- PARTNERSHIP LIFE INSURANCE\n- PERMANENT LIFE INSURANCE\n- PURE ENDOWMENT\n- RE-ENTRY TERM LIFE INSURANCE\n- RENEWABLE TERM LIFE INSURANCE\n- REVERSE SPLIT DOLLAR LIFE INSURANCE\n- SAVINGS BANK LIFE INSURANCE\n- SPLIT DOLLAR COLLATERAL LIFE INSURANCE\n- SPLIT DOLLAR ENDOWMENT LIFE INSURANCE\n- SPLIT DOLLAR LIFE INSURANCE\n- SPLIT LIFE INSURANCE\n- SURVIVORSHIP LIFE INSURANCE\n- UNIVERSAL VARIABLE LIFE INSURANCE\n- VARIABLE LIFE INSURANCE\n- VARIABLE PREMIUM LIFE INSURANCE\n\nwhere:\n\nACCELERATION LIFE INSURANCE: \nA type of life insurance policy in which a portion of the Death Benefit is payable to the insured for a pre-specified medical condition prior to death.\n\nThe intent of the accelerated death benefit is to provide the money required to finance medical costs to improve or extend the life of the insured.   \n\nWhen presented with proof that the specified medical condition exists, the insurance company will pay the percentage of the death benefit to the insured.  \n\nThe remainder of the death benefit is paid to the beneficiary upon the death of the insured as in a traditional life insurance policy.\n\nACCELERATIVE ENDOWMENT LIFE INSURANCE: \nA type life Insurance policy in which the dividends that accrue are applied to the matured policy as endowment insurance.\n\nADJUSTABLE LIFE INSURANCE: \nLife insurance coverage in which several policy components may be changed or modified at the discretion of the policyowner without writing issuing additional policies.\n\nThe components that can be changed are typically:\n\n(1)  The face value of the policy can be increased or decreased.    The cash value will be reflected in the amount of the face value and premium.\n\n(2)  Premiums and the premiums payment schedule can be increased or decreased.\n\nUnscheduled premiums can be paid in a single lump-sum amount.\n\nAVIATION TRIP LIFE INSURANCE: \nTerm life insurance that provides a death payment to the passenger's beneficiary in the event of a fatal aviation accident.  \n\nTypically the insurance is purchased at an airport by the passenger.\n\nThe term of the coverage is normally from the time that the passenger enters the airplane until the time that he departs the airplane.     Sometimes ground transportation to and from the airport is covered.\n\nBLANKET LIFE: \nBlanket life insurance covers a group of people exposed to a common hazard.\n\nIndividuals do not need to apply for blanket coverage and insurers do not need to provide each person with a certificate of coverage.   Insured parties are also not specifically named in the policy because it is temporary coverage.\n\nAn example is a policy issued to the owner of an airline to cover passengers.\n\nCASH VALUE LIFE INSURANCE: \nA life insurance policy that incorporates a savings element.   \n\nThe size of the cash value depends on the cash value amount and the age of the policy owner\n\nThe policyowner has options based upon the cash value to convert to a monthly retirement income.\n\nThe size of the cash value accumulating differs from company to company.\n\nCHARITABLE GIFT LIFE INSURANCE: \nAn annuity donation made by a donor to a charity.\n\nThe charity agrees to pay the donor an amount of the rest of the donor's life.\n\nThe donation is used to fund an annuity, only a percentage of the donation can be taken as a tax deductible gift in the year of the donation.\n\nThe donor is dependent on the charity to make income payments and therefore should ascertain the ability of the charity to maintain those payments.\n\nThis annuity permits the donor to transfer appreciated property to a charitable organization in exchange for the promise by the organization to pay a continuous stream of income through his life.\n\nCONTINUOUS PREMIUM WHOLE LIFE INSURANCE: \nA life insurance policy that remains in effect for the life of the insured with premiums made for the same period.\n\nCONVERTIBLE TERM LIFE INSURANCE: \nLife insurance that can be converted into permanent life insurance regardless of an insured's physical condition and without a medical examination.\n\nThe individual cannot be denied covered or charged additional premiums for health problems.\n\nCREDIT LIFE INSURANCE: \nLife insurance that is designed to cover the life of a debtor and pay an amount due on a loan if the debtor dies before the loan is repaid.\n\nThis insurance is decreasing term where the term matches the length of the loan period and the decreasing insurance amount matched to the declining loan balance.\n\nCROSS PURCHASE PLAN: \nA binding buy-sell agreement used in partnerships in which each partner agrees to purchase the business interest of a deceased or disabled partner.\n\nCURRENT ASSUMPTION WHOLE LIFE INSURANCE: \nA life insurance policy that is a variation of Ordinary Life Insurance in which the mortality experience and investment earnings are credited to the insurance policy either through the cash value account and/or premium structure or the dividend structure.\n\nThe policy is characterized by:\n\n(1)  Premiums subject to change.  \n\n These are not controlled by the insurance company, not the policyowner.\n\n(2)  The policyowner can use the cash value to make loans.\n\n(3)  A minimum amount of cash value is guaranteed\n\n(4)  The death benefit does not fluctuate\n\nThis type of insurance is also known as 'Interest-Sensitive Whole Life'.\n\nDEATH BENEFIT ONLY LIFE INSURANCE: \nLife insurance that is payable only upon the death of the person stated in the policy (the 'key employee').\n\nDECREASING TERM LIFE INSURANCE: \nLife insurance coverage in which the face amount of the life insurance policy declines by a predefined amount over a period of time.\n\nDEPOSIT TERM LIFE INSURANCE: \nA life insurance policy in which a premium, deposit, is paid in the first policy year in addition to the regular term insurance premiums required.\n\nThe deposit is left to accumulate at interest for a specific number of years.\n\nAfter that, the policyowner can receive the deposit plus interest or may renew the policy without the insured having to furnish evidence of insurability.\n\nA deposit term life insurance policy can be converted to ordinary life or decreasing term life insurance without evidence of insurability.\n\nIf the policyowner cancels the policy prior to the initial period, the deposit and any interest is forfeited.\n\nIf the insured dies before the policy is converted, the deposit plus the interest is added to the death benefit.\n\nDOUBLE-PROTECTION LIFE: \nA life insurance contract combining Term Life Insurance with Whole Life Insurance.\n\nThe contract's term portion expires after a predefined period.  \n\nIf the insured should die during the stipulated period, then both the term portion and the whole life portion will pay.\n\nIf the insured dies after the stipulated period, then only the whole life portion of the contract pays.\n\nENDOWMENT LIFE INSURANCE: \nLife insurance in which an insured receives the face value of a policy should the individual survive the endowment period.\n\nIf the insured does not survive, a beneficiary receives the face value of the policy.\n\nAn endowment policy provides benefits in one of two ways:\n\n(1)  A death benefit to the beneficiary(s) if the insured dies within a specified period (the 'endowment period').\n\n(2)  A living benefit to the policyholder if the insured is still alive at the end of the endowment period when the policy has fully matured.\n\nTypes of Endowment Life Insurance Policies:\n\n- 10-year Endowment\n\n- 20-year Endowment\n\n- 25-year Endowment\n\n- 30-year Endowment\n\n- Endowment at Age 55\n\n- Endowment at Age 60\n\n- Endowment at Age 65\n\n- 20-Pay Endowment at Age 60\n\n- 20-Pay Endowment at Age 65\n\n- Single Premium Endowment\n\nENHANCED ORDINARY LIFE INSURANCE: \nA modified participating coverage life insurance policy in which the dividends are credited to the policy.   The dividends therefore reduce the premiums below that usually charged for ordinary life insurance.\n\nDividends are used to purchase increments of Paid-up Additions of permanent life insurance.\n\nAs the face value of the policy is reduced, the accumulated paid-up additions are generally sufficient to makeup the difference between the reduced face amount of insurance and the initial face amount of insurance purchased.\n\nThis maintains the Death Benefit at a level at least equal to the original amount of insurance purchased.   Most of these policies guarantee that the death benefit will not fall below the original amount of insurance purchased.\n\nENTITY PLAN: \nA buy-sell agreement used in a partnership in which the partnership agrees to purchase the interest of a deceased or disabled partner.\n\nFAMILY MAINTENANCE INSURANCE: \nA combination of whole life and level term insurance providing income to a beneficiary for a period of time if the insured dies during the period.\n\nAt the end of the income-paying period the beneficiary receives the entire face amount of the policy.\n\nIf the insured dies after the end of the selected period, the beneficiary receives only the face value of the policy.   The remainder of the benefits are the same as under the Family Income Policy.\n\nFAMILY INCOME INSURANCE: \nA life insurance contract combining whole life and decreasing term insurance.\n\nA monthly income is paid to a beneficiary if the insured dies during a predefined period.\n\nAt the end of that period, the full face amount of the policy is also paid to the beneficiary.\n\nIt is designed to provide income for a household while the children are still young.\n\nIf the insured dies after the specified period, only the face amount of the policy is paid.\n\nFIRST-TO-DIE LIFE INSURANCE: \nThe same as Joint Life Insurance.\n\nLife insurance coverage of two or more individuals with the death benefit payable at the first death.\n\nFLEXIBLE ENHANCED ORDINARY LIFE INSURANCE: \nA life insurance policy based upon modified Enhanced Ordinary Life in which there is a combination of dividend purchasing paid-up additions, term life insurance and ordinary life insurance.\n\nThe structure of this life insurance product is such that a minimum face amount of ordinary life insurance must be maintained but the policyowner is not limited in the amount of term life insurance that may be added.\n\nAt any time after issue, the policyowner may increase or decrease the amount of term life insurance as well as increase or decrease the amount of extra premiums paid into the policy.\n\nFLEXIBLE SPENDING ACCOUNT LIFE INSURANCE: \nA life insurance account established by the insurance company specifically for beneficiaries of a life insurance policy in which the beneficiary has the choice of leaving the death benefit on deposit in the account and earning interest or writing checks on the deposited amount.\n\nFRANCHISE LIFE: \nFranchise life is a form of group insurance in which the employees covered are employees of a common employer or a members of a common association or society.    It deviates in that the sponsor is not the master policyholder but rather it serves as the sponsor of the plan and collects premiums from the members. \n\nEach individual is insured under a franchise arrangement and given an individual policy, which remains in force as long as they maintain a valid relationship with the sponsor.\n\nFRATERNAL LIFE INSURANCE: \nGroup life insurance coverage for members of a fraternal association.\n\nThis is usually done on a non-profit basis.\n\nGROUP CREDIT LIFE: \nGroup credit life insurance a type of decreasing term insurance issued by insurance companies to creditors to cover the lives of debtors in the amounts of their respective loans.\n\nIf an insured dies before the loan is repaid, the policy proceeds are paid to the creditor to settle the remaining loan balance.\n\nGROUP PERMANENT LIFE INSURANCE: \nGroup life insurance that approximates the structure of group term life insurance.\n\nHowever, premiums go toward the purchase of permanent insurance instead of term insurance.\n\nThe employee has a vested interest in the increments of paid-up insurance purchased.\n\nGroup permanent life insurance is usually used to fund retirement plans because of the tax benefits.   If the employer purchased permanent insurance on the employee's behalf, the contributions would become taxable income to the employee on a current basis.\n\nGROUP TERM LIFE INSURANCE: \nOne year life insurance coverage that is renewable at the end of the year.\n\nThe premium rate upon renewal is based on loss record of the group and employees ages.\n\nAll employees are insured with term life insurance.\n\nThe employee usually not convert group term to individual permanent insurance because the conversion is at a higher attained age rate.\n\nGROUP UNIVERSAL LIFE INSURANCE: \nA contract between the policy holder and the insurer, where the insurer promises to pay a designated beneficiary a sum of money (premium) upon the death of the insured person.\n\nGUARANTEED COST NONPARTICIPATING LIFE INSURANCE: \nA life insurance policy whose premiums, cash value and face amount are all guaranteed.\n\nIt is nonparticipating, so the policyowner does not share with the insurance company when the insurance company experiences good financial fortunes.  \n\nConversely, the policyowner does not share negative financial results either.\n\nINDEXED LIFE INSURANCE: \nA life insurance policy with a face value that varies according to a prescribed index of prices.\n\nOther benefits are similar to ordinary whole life.\n\nThe death benefit is based on the particular index used.   The policyowner has the choice of having the index applied either automatically or on an elective basis.\n\nWith the automatic index increase, the premium remains level.\n\nWith the optional index increase, an extra premium is charged when this option is exercised.\n\nThe death benefit as it increases does not require another physical examination or evidence of insurability.\n\nINDUSTRIAL LIFE INSURANCE: \nA life insurance policy consisting of modest face values sold on a debit basis.\n\nIRREVOCABLE LIFE INSURANCE TRUST: \nAn estate planning device used so that any life insurance policies owned by and paid to the Trust will avoid Estate Tax upon the death of the insured.\n\nEstate taxes will be avoided as well.\n\nRequirements are that the trust must irrevocable and no distributions of the trust's principle or income may be made to the insured.   All income generated by the trust must be accumulated and distributed with the trust's principal to the trust's beneficiary.\n\nJOINT LIFE AND SURVIVOR INSURANCE: \nInsurance coverage for two or more individuals with the death benefit payable at the death of the last of those insured.\n\nPremiums are significantly lower for this type of insurance since the probability of having to pay a death claim is lower.\n\nJOINT LIFE INSURANCE: \nLife insurance coverage of two or more individuals with the death benefit payable at the first death.\n\nJUVENILE INSURANCE: \nLife insurance that is written on the lives of children.\n\nApplication for insurance and ownership of the insurance policy rests with an adult such as a parent or guardian.\n\nStates normally limit the amount of life insurance that can be written on a child at the early ages by defining a maximum that can be in force at various ages.\n\nKEY EMPLOYEES LIFE INSURANCE: \nInsurance on the life of a key employee for whom the loss of their services would cause a financial loss to the employer.   \n\nThe policy is owned by and payable to the employer.\n\nLEVERAGED SPLIT DOLLAR LIFE INSURANCE: \nLife insurance that is modified collateral Split Dollar Life Insurance in which the employee purchases and owns a life insurance policy on their own life.\n\nThe employee makes a collateral assignment of the policy to the employer, which acts as security for the unscheduled premiums paid by the employer.\n\nUpon this assignment, the life insurance company issuing the policy lends the employer the amount of the unscheduled premium payment.   Interest paid to the insurance company by the employer for the loan is tax-deductible to the employer.\n\nPart of the interest paid by the employer is credited to the cash value of the policy by the insurance company.   During this period, the employer also makes scheduled premium payments.\n\nThe scheduled premium payments are taxed as ordinary current income to the employee.   When the employee retires, the split dollar plan is terminated and all of the unscheduled premium payments made by the employer are repaid to the employee as either loans on the cash value of the policy or as cash withdrawals from the policy.\n\nWith the repaid premiums amount, the employer may then repay the insurance company for the previous loans to pay the unscheduled premium payments.  The repaid loan amount is credited to the cash value of the policy by the insurance company.\n\nThe employee borrows a series of annual income payments based on the employee's life expectancy from the reconstituted cash values.   When the employee dies, the Death Benefit from the policy repays the amount owed the insurance company for the loans from the cash value made to fund the retirement income of the employee.   \n\nThe excess amount of the death benefit minus the policy loan repayment is paid to the employee's beneficiary.\n\nLIMITED PAYMENT LIFE INSURANCE: \nA type of life insurance policy in which premiums are fully paid up with a predefined period and no additional premiums are paid.\n\nMULTIPLE EMPLOYER TRUST (MET): \nA method of marketing group benefits to employers with a small number of employees.\n\nAn employer who wants to get coverage for employees from a MET must first become a member of the trust by subscribing to it.   The employer is issued a joinder agreement defining the relationship between the trust and the employer and specifying the coverages to which the employer has subscribed.\n\nA MET may be self-funded or fund benefits with a contract purchased from an insurance company.\n\nMULTIPLE PROTECTION LIFE INSURANCE: \nA single life insurance policy that combines Term Life Insurance and Ordinary Life Insurance.   \n\nIf the insured dies during the term period, a multiple of the face amount is paid to the beneficiary.\n\nIf the insured dies after the term period has expired, only the face amount is paid to the beneficiary.\n\nPARTNERSHIP LIFE INSURANCE: \nLife insurance sold to a partnership that addresses or guarantees business continuity in case of the death or disability of one of the partners.\n\nEx:\n\nPartners might buy life insurance on each other so that in the event of one partner's death the other can use the insurance proceeds to purchase his share of the business from his heirs.\n\nPERMANENT LIFE INSURANCE: \nA term loosely applied to life insurance policy forms other than Group and Term, usually Cash Value Life Insurance such as Whole or Ordinary Life policies or endowments.\n\nPURE ENDOWMENT: \nA life insurance policy in which its face value is payable only if the insured survive to the end of the predefined endowment period.\n\nNo benefit is paid if the insured dies during the endowment period.\n\nRE-ENTRY TERM LIFE INSURANCE: \nYearly renewable term life insurance in which an insured can apply for term insurance every fifth year at a lower premium than the guaranteed renewal rate.\n\nIf the insured's health is good, the guaranteed renewable term premium can be reduced.\n\nOtherwise, the guaranteed rate must be continued to be paid on renewal.\n\nRENEWABLE TERM LIFE INSURANCE: \nRenewable life insurance that is renewable at the option of the insured. \n\nThe insured is not required to take a medical examination.\n\nRegardless of physical condition, the insured must be allowed to renew the policy and the premium cannot be increased to reflect any adverse physical condition.\n\nThe premium is however adjusted at each renewal to reflect the life expectancy of the insured at that age.\n\nREVERSE SPLIT DOLLAR LIFE INSURANCE: \nA life insurance policy that is the opposite of the traditional Split Dollar Life Insurance policy in that:\n\nSAVINGS BANK LIFE INSURANCE: \nLow cost life insurance policies sold by savings banks in Connecticut, Massachusetts and New York.  Maximum policy amounts are limited by state law.\n\nSPLIT DOLLAR COLLATERAL LIFE INSURANCE: \nSplit Dollar Collateral - in which the employee owns the policy.  The employee pays premium contributions, which are viewed as a series of interest-free loans, equal to the yearly increase in the cash value of the policy.   The employee assigns the policy to the employer as collateral for these loans.   When the employee dies, then the loans are paid from the face value of the policy.  The beneficiary receives and remaining proceeds.\n\nSPLIT DOLLAR ENDOWMENT LIFE INSURANCE: \nSplit Dollar Endowment - in which the employer owns all policy privileges.   The employees only rights are to choose beneficiaries and to select the manner in which the death benefit is paid.\n\nSPLIT DOLLAR LIFE INSURANCE: \nA life insurance policy in which premiums, ownership rights and death benefits are split between an employer and the employee, or between a child and parent.\n\nThe employer pays the part of each years premium that at least equals the increase in the cash value.  The employee may pay the remainder of the premium or the employer may pay the entire premium.\n\nWhen the increase in cash value equals or exceeds the yearly premium, the employer pays the entire premium.   \n\nIf the employee dies while in the service of the employer, a beneficiary chosen by the employee then receives the difference between the face value and the amount paid to the employer, whichever is greater.\n\nDuring employment, the employee share of the death benefit decreases.   If the employee leaves the employer, the employer has the option of surrendering the policy to the employee in exchange for premiums paid or selling the policy to the employee for the amount of its cash value.\n\nThere are two types of Split Dollar Life Insurance Policies:\n\n(1) Split Dollar Endowment - in which the employer owns all policy privileges.   The employees only rights are to choose beneficiaries and to select the manner in which the death benefit is paid.\n\n(2) Split Dollar Collateral - in which the employee owns the policy.  The employee pays premium contributions, which are viewed as a series of interest-free loans, equal to the yearly increase in the cash value of the policy.   The employee assigns the policy to the employer as collateral for these loans.   When the employee dies, then the loans are paid from the face value of the policy.  The beneficiary receives and remaining proceeds.\n\nSPLIT LIFE INSURANCE:\nLine insurance that is a combination of Term Life Insurance and an Installment Refund Annuity.\n\nSURVIVORSHIP LIFE INSURANCE:\nA life insurance policy in which more than one person pays a benefit after all of the insureds have died.  \n\nThis is a type of Joint Life Policy that is cheaper than a regular policy.\n\nThis type of life insurance may be used to fund estate taxes after the deaths of the husband and wife or as form of business continuation insurance.\n\nUNIVERSAL VARIABLE LIFE INSURANCE:\nA life insurance policy that combines the features of Universal Life Insurance and Variable Life Insurance in that the excess interest that is credited to the cash value account depends on the investment results of separate accounts.\n\nThe policyholder selects that accounts (stocks, bonds etc.) into which premiums are to be invested.\n\nThis is an equity product that requires SEC, annual prospectus and account audits.\n\nVARIABLE LIFE INSURANCE:\nWhole life insurance that is investment-oriented providing a return that is linked to an underlying portfolio of stocks.  \n\nThe portfolio is typically a group of mutual funds defined by the insurer as a separate account.\n\nThe policyholder is given some discretion in choosing the asset mix.\n\nThis type of insurance offers fixed premiums and a minimum death benefit.\n\nThe better the total return on the portfolio, the higher the death benefit or surrender value of the life policy.\n\nVARIABLE PREMIUM LIFE INSURANCE:\nA life insurance policy allowing premium payments to vary within certain parameters at the policyholder's option.\n\nIn return, the death benefit and rate of cash value accumulation varies with the premium payments.",
			"DisplayFolderInfo": "{\"name\":\"Party\",\"colorCode\":\"#0E3D73\"}",
			"PrimaryKeys": "ProductId"
		},
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false
	},
	"type": "TABLE"
}