{
	"name": "MortgageLoanType",
	"properties": {
		"Name": "MortgageLoanType",
		"EntityType": "TABLE",
		"Namespace": {
			"DatabaseName": "Banking_wex"
		},
		"Description": "The type of mortgage loan.\n\nEx:\n- Adjustable Rate Mortgage (ARM) Loan\n- Assumed Mortgage Loan\n- Balloon Loan\n- Buydown Mortgage Loan\n- Conventional Loan\n  - Conforming\n  - Non-Conforming\n- Convertible ARM Loan\n- FHA Loan\n- FNMA Loan\n- Fixed Rate Mortgage Loan\n- Fixed Rate ARM\n- Government Loan\n- Graduated Payment Mortgage (GPM) Loan\n- Jumbo Loan\n- Negative Amortizing Loan\n- RHS Loan\n- Two-Step Mortgage Loan\n- VA Loan\n\nWhere:\n\nADJUSTABLE RATE MORTGAGE (ARM)\nVariable or adjustable loans are loans whose interest rate, and accordingly monthly payments, fluctuate over the period of the loan. With this type of mortgage, periodic adjustments based on changes in a defined index are made to the interest rate. The index for your particular loan is established at the time of application.\n\nThe margin is fixed percentage points added to the index to compute the interest rate. The margins remain fixed for the term of the loan and are not impacted by the financial markets and movement of interest rates. Lenders use a variety of margins depending upon the loan program and adjustment periods.\n\nMost ARMs have an interest rate cap to protect you from enormous increases in monthly payments. A lifetime cap limits the interest rate increase over the life of the loan. A periodic or adjustment cap limits how much your interest rate can rise at one time. Your mortgage disclosure will tell you the exact index, to be used, whether the weekly or monthly value applies, the lead time for your index, the margin, and any caps.\n\nASSUMED MORTGAGE\nIn an assumed mortgage the buyer of a real estate property is transferred all the obligations of the seller's mortgage and the buyer assumes all the obligations under the mortgage as though the loan had been made to the buyer.\n\nBALLOON LOAN\nBalloon loans are short-term fixed rate loans that have fixed monthly payments based usually upon a 30-year fully amortizing schedule and a lump sum payment at the end of its term. Usually they have terms of 3, 5, and 7 years.\n\nThe advantage of this type of loan is that the interest rate on balloon loans is generally lower than 30- and 15- year mortgages resulting in lower monthly payments. The disadvantage is that at the end of the term you will have to come up with a lump sum to pay off your lender, either through a refinance or from your own savings.\n\nBalloon loans with refinancing option allow borrowers to convert the mortgage at the end of the balloon period to a fixed rate loan -- based upon the outstanding principal balance -- if certain conditions are met. If you refinance the loan at maturity you need not be requalified, nor the property reapproved. The interest rate on the new loan is a current rate at the time of conversion. There might be a minimal processing fee to obtain the new loan. The most popular terms are 5/25 Balloon, and 7/23 Balloon. \n\nBUYDOWN MORTGAGE\nA temporary buydown is the type of loan with an initially discounted interest rate which gradually increases to an agreed-upon fixed rate usually within one to three years. An initially discounted rate allows you to qualify for more house with the same income and gives you the advantage of lower initial monthly payments for the first years of the loan when extra money may be needed for furnishings or home improvements. To reduce your monthly payments during the first few years of a mortgage you make an initial lump sum payment to the lender. If you do not have the cash to pay for the buydown, the lender can pay this fee if you agree on a little higher interest rate. The lower rate may apply for the full duration of the loan or for just the first few years. A buydown may be used to qualify a borrower who would otherwise not qualify . This is because a buydown results in lower payments which are easier to qualify for.\n\nCONVENTIONAL LOAN\n- Conforming\n- Non-Conforming\n\nAny mortgage loan other than an FHA, VA or an RHS loan is a conventional one.\n\nConventional loans may be conforming and non-conforming. Conforming loans have terms and conditions that follow the guidelines set forth by Fannie Mae and Freddie Mac. These two stockholder-owned corporations purchase mortgage loans complying with the guidelines from mortgage lending institutions, packages the mortgages into securities and sell the securities to investors. By doing so, Fannie Mae and Freddie Mac, like Ginnie Mae, provide a continuous flow of affordable funds for home financing that results in the availability of mortgage credit for Americans. Fannie Mae and Freddie Mac guidelines establish the maximum loan amount, borrower credit and income requirements, down payment, and suitable properties. Fannie Mae and Freddie Mac announces new loan limits every year.\n\nCONVERTIBLE ARM\nSome ARMs come with option to convert them to a fixed-rate mortgage at designated times (usually during the first five years on the adjustment date), if you see interest rates starting to rise. The new rate is established at the current market rate for fixed-rate mortgages.\n\nThe conversion is typically done for a nominal fee and requires almost no paperwork. The disadvantage is that the conversion interest rate is typically a little higher than the market rate at that time.\n\nThe other kind of convertible mortgage is a fixed rate loan with rate reduction option. If rates had dropped since the time of closing it allows you, under some prescribed conditions, for a small conversion fee to adjust your mortgage to going market rate. Generally the interest rate or discount points may be a little higher for a convertible loan.\n\nFHA LOAN\nA government-backed mortgage loan supported by the US FHA and the Department of Housing and Urban Development (HUD). \n\nFHA\n(Federal Housing Administration). A division of the Department of Housing and Urban Development. The FHA's main activity is the insuring of residential mortgage loans made by private lenders. It sets standards for construction and underwriting. FHA neither lends money, nor plans, nor constructs housing.\n\nAn agency under the U.S. Department of Housing and Urban Development (HUD), it insures loans made by approved lenders to qualified borrowers, in accordance with its regulations.\n\nFNMA LOAN\nThe Federal National Mortgage Association is a congressionally chartered, shareholder-owned company. This organization is the nation's largest supplier of home mortgage funds.\n\nFIXED RATE MORTGAGE\nWith fixed rate mortgage (FRM) loan the interest rate and your mortgage monthly payments remain fixed for the period of the loan. Fixed-rate mortgages are available for 30, 25, 20, 15 years and 10 years. Generally, the shorter the term of a loan, the lower the interest rate you could get.\n\nThe most popular mortgage terms are 30 and 15 years. With the traditional 30-year fixed rate mortgage your monthly payments are lower than they would be on a shorter term loan. But if you can afford higher monthly payments a 15-year fixed-rate mortgage allows you to repay your loan twice as faster and save more than half the total interest costs of a 30-year loan.\n\nThe payments on fixed rate fully amortizing loans are calculated so that at the end of the term the mortgage loan is paid in full. During the early amortization period, a large percentage of the monthly payment is used for paying the interest. As the loan is paid down, more of the monthly payment is applied to principal.\n\nWith biweekly mortgage plan you pay half of the monthly mortgage payment every 2 weeks. It allows you to repay a loan much faster. For example, a 30 year loan can be paid off within 18 to 19 years.\n\nFIXED RATE ARM\nWith fixed-period ARMs homeowners can enjoy from three to ten years of fixed payments before the initial interest rate change. At the end of the fixed period, the interest rate will adjust annually. Fixed-period ARMs -- 30/3/1, 30/5/1, 30/7/1 and 30/10/1 -- are generally tied to the one-year Treasury securities index. ARMs with an initial fixed period beside of lifetime and adjustment caps usually have also first adjustment cap. It limits the interest rate you will pay the first time your rate is adjusted. First adjustment caps vary with type of loan program.\n\nGOVERNMENT LOAN\nThe Federal Housing Administration (FHA), which is part of the U.S. Dept. of Housing and Urban Development (HUD), administers various mortgage loan programs. FHA loans have lower down payment requirements and are easier to qualify than conventional loans. FHA loans cannot exceed the statutory limit.\n\nGRADUATED PAYMENT MORTGAGE (GPM)\nGraduated payment mortgages have payments that start low and gradually increase at predetermined times. A lower initial payments allow you to qualify for a larger loan amount. The monthly payments will eventually be higher in order to catch up from the lower payments. In fact, your loan will be negatively amortizing during the early years of the loan, then pay off the principal at an accelerated pace through the later years.\n\nLenders offer different GPM payment plans, which vary in the rate of payment increases and the number of years over which the payments will increase. The greater the rate of increase or the longer the period of increase, the lower the mortgage payments in the early years.\n\nJUMBO LOAN \nLoans above the maximum loan amount established by Fannie Mae and Freddie Mac are known as 'jumbo' loans. Because jumbo loans are bought and sold on a much smaller scale, they often have a little higher interest rate than conforming, but the spread between the two varies with the economy.\n\nNEGATIVE AMORTIZING LOAN\nSome types of ARMs offer payment caps rather than interest rate caps, which limit the amount the monthly payment can increase. If a loan has a payment cap but has no periodic interest rate cap, then the loan may become negatively amortized: if the interest rates rise to the point that the monthly mortgage payment does not cover the interest due, any unpaid interest will get added to the loan balance, so the loan balance increases. However, you always have the option to pay the minimum monthly payment, or the fully amortized amount due.\n\nThe advantage of negatively amortizing loans is that you can control cash flow (relatively stable payment), take advantage of low interest rates relative to the market at any given time, and pay back the money borrowed today at a depreciated value years from now (because of natural inflation). This makes such loans a great tool for homeowners as long as you understand the mechanics of what's going on.\n\nWith most ARMs, the interest rate can adjust every six months, once a year, every three years, or every five years. The interest rate on negatively amortized loans can adjust monthly. A loan with an adjustment period of 6 months is called a 6-month ARM, with an adjustment period of 1 year is called a 1-year ARM, and so on. Most ARMs offer an initial lower interest rate than the fully indexed rate (index plus margin) during the initial period of the loan, which could be one month or a year or more. It is also known as teaser rate.\n\nAll ARMs are available with 30-year terms and some with 15-year terms.\n\nAdjustable rate mortgages generally have a lower initial interest rate than fixed rate loans.\n\nTWO-STEP MORTGAGE\nTwo-Step mortgages have a fixed rate for a certain time, most often 5 or 7 years, and then interest rate changes to a current market rate. After that adjustment the mortgage maintains new fixed rate for the remaining 23 or 25 years.\n\nRHS LOAN\nThe Rural Housing Authority.\n\nVA LOAN\nVA loans are guaranteed by U.S. Dept. of Veterans Affairs. The guaranty allows veterans and service persons to obtain home loans with favorable loan terms, usually without a down payment. In addition, it is easier to qualify for a VA loan than a conventional loan. Lenders generally limit the maximum VA loan to $203,000. The U.S. Department of Veterans Affairs does not make loans, it guarantees loans made by lenders. VA determines your eligibility and, if you are qualified, VA will issue you a certificate of eligibility to be used in applying for a VA loan. VA-guaranteed loans are obtained by making application to private lending institutions.",
		"TableType": "EXTERNAL",
		"Origin": {
			"Type": "SPARK"
		},
		"StorageDescriptor": {
			"Columns": [
				{
					"Name": "MortgageLoanTypeId",
					"Description": "The unique identifier of a Mortgage Loan Type.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanType.cdm.json/MortgageLoanType",
						"Name": "MortgageLoanTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "MortgageLoanTypeName",
					"Description": "The name of a Mortgage Loan Type.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanType.cdm.json/MortgageLoanType",
						"Name": "MortgageLoanTypeName"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 256,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "MortgageLoanTypeDescription",
					"Description": "The description of a Mortgage Loan Type.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanType.cdm.json/MortgageLoanType",
						"Name": "MortgageLoanTypeDescription"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				}
			],
			"Format": {
				"InputFormat": "org.apache.hadoop.mapred.SequenceFileInputFormat",
				"OutputFormat": "org.apache.hadoop.hive.ql.io.HiveSequenceFileOutputFormat",
				"FormatType": "csv",
				"SerializeLib": "org.apache.hadoop.hive.serde2.lazy.LazySimpleSerDe",
				"Properties": {
					"path": "abfss://packagezone@azureadlsstoragesa.dfs.core.windows.net/Banking_wex/MortgageLoanType",
					"delimiter": ",",
					"multiLine": "false",
					"firstRowAsHeader": "false",
					"serialization.format": "1",
					"escape": "\\",
					"quote": "\"",
					"FormatTypeSetToDatabaseDefault": true,
					"header": "false"
				}
			},
			"Source": {
				"Provider": "ADLS",
				"Location": "abfss://packagezone@azureadlsstoragesa.dfs.core.windows.net/Banking_wex/MortgageLoanType",
				"Properties": {
					"LinkedServiceName": "azuresynapsetrainings-WorkspaceDefaultStorage",
					"LocationSetToDatabaseDefault": true
				}
			},
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "{\"type\":\"None\",\"level\":\"optimal\"}",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"MortgageLoanTypeId\":{\"entity\":\"MortgageLoanType.cdm.json/MortgageLoanType\",\"name\":\"MortgageLoanTypeId\"},\"MortgageLoanTypeName\":{\"entity\":\"MortgageLoanType.cdm.json/MortgageLoanType\",\"name\":\"MortgageLoanTypeName\"},\"MortgageLoanTypeDescription\":{\"entity\":\"MortgageLoanType.cdm.json/MortgageLoanType\",\"name\":\"MortgageLoanTypeDescription\"}}}"
			},
			"Compressed": false,
			"IsStoredAsSubdirectories": false
		},
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"MortgageLoanType\",\"path\":\"MortgageLoanType.cdm.json/MortgageLoanType\"},\"description\":\"The type of mortgage loan.\\n\\nEx:\\n- Adjustable Rate Mortgage (ARM) Loan\\n- Assumed Mortgage Loan\\n- Balloon Loan\\n- Buydown Mortgage Loan\\n- Conventional Loan\\n  - Conforming\\n  - Non-Conforming\\n- Convertible ARM Loan\\n- FHA Loan\\n- FNMA Loan\\n- Fixed Rate Mortgage Loan\\n- Fixed Rate ARM\\n- Government Loan\\n- Graduated Payment Mortgage (GPM) Loan\\n- Jumbo Loan\\n- Negative Amortizing Loan\\n- RHS Loan\\n- Two-Step Mortgage Loan\\n- VA Loan\\n\\nWhere:\\n\\nADJUSTABLE RATE MORTGAGE (ARM)\\nVariable or adjustable loans are loans whose interest rate, and accordingly monthly payments, fluctuate over the period of the loan. With this type of mortgage, periodic adjustments based on changes in a defined index are made to the interest rate. The index for your particular loan is established at the time of application.\\n\\nThe margin is fixed percentage points added to the index to compute the interest rate. The margins remain fixed for the term of the loan and are not impacted by the financial markets and movement of interest rates. Lenders use a variety of margins depending upon the loan program and adjustment periods.\\n\\nMost ARMs have an interest rate cap to protect you from enormous increases in monthly payments. A lifetime cap limits the interest rate increase over the life of the loan. A periodic or adjustment cap limits how much your interest rate can rise at one time. Your mortgage disclosure will tell you the exact index, to be used, whether the weekly or monthly value applies, the lead time for your index, the margin, and any caps.\\n\\nASSUMED MORTGAGE\\nIn an assumed mortgage the buyer of a real estate property is transferred all the obligations of the seller's mortgage and the buyer assumes all the obligations under the mortgage as though the loan had been made to the buyer.\\n\\nBALLOON LOAN\\nBalloon loans are short-term fixed rate loans that have fixed monthly payments based usually upon a 30-year fully amortizing schedule and a lump sum payment at the end of its term. Usually they have terms of 3, 5, and 7 years.\\n\\nThe advantage of this type of loan is that the interest rate on balloon loans is generally lower than 30- and 15- year mortgages resulting in lower monthly payments. The disadvantage is that at the end of the term you will have to come up with a lump sum to pay off your lender, either through a refinance or from your own savings.\\n\\nBalloon loans with refinancing option allow borrowers to convert the mortgage at the end of the balloon period to a fixed rate loan -- based upon the outstanding principal balance -- if certain conditions are met. If you refinance the loan at maturity you need not be requalified, nor the property reapproved. The interest rate on the new loan is a current rate at the time of conversion. There might be a minimal processing fee to obtain the new loan. The most popular terms are 5/25 Balloon, and 7/23 Balloon. \\n\\nBUYDOWN MORTGAGE\\nA temporary buydown is the type of loan with an initially discounted interest rate which gradually increases to an agreed-upon fixed rate usually within one to three years. An initially discounted rate allows you to qualify for more house with the same income and gives you the advantage of lower initial monthly payments for the first years of the loan when extra money may be needed for furnishings or home improvements. To reduce your monthly payments during the first few years of a mortgage you make an initial lump sum payment to the lender. If you do not have the cash to pay for the buydown, the lender can pay this fee if you agree on a little higher interest rate. The lower rate may apply for the full duration of the loan or for just the first few years. A buydown may be used to qualify a borrower who would otherwise not qualify . This is because a buydown results in lower payments which are easier to qualify for.\\n\\nCONVENTIONAL LOAN\\n- Conforming\\n- Non-Conforming\\n\\nAny mortgage loan other than an FHA, VA or an RHS loan is a conventional one.\\n\\nConventional loans may be conforming and non-conforming. Conforming loans have terms and conditions that follow the guidelines set forth by Fannie Mae and Freddie Mac. These two stockholder-owned corporations purchase mortgage loans complying with the guidelines from mortgage lending institutions, packages the mortgages into securities and sell the securities to investors. By doing so, Fannie Mae and Freddie Mac, like Ginnie Mae, provide a continuous flow of affordable funds for home financing that results in the availability of mortgage credit for Americans. Fannie Mae and Freddie Mac guidelines establish the maximum loan amount, borrower credit and income requirements, down payment, and suitable properties. Fannie Mae and Freddie Mac announces new loan limits every year.\\n\\nCONVERTIBLE ARM\\nSome ARMs come with option to convert them to a fixed-rate mortgage at designated times (usually during the first five years on the adjustment date), if you see interest rates starting to rise. The new rate is established at the current market rate for fixed-rate mortgages.\\n\\nThe conversion is typically done for a nominal fee and requires almost no paperwork. The disadvantage is that the conversion interest rate is typically a little higher than the market rate at that time.\\n\\nThe other kind of convertible mortgage is a fixed rate loan with rate reduction option. If rates had dropped since the time of closing it allows you, under some prescribed conditions, for a small conversion fee to adjust your mortgage to going market rate. Generally the interest rate or discount points may be a little higher for a convertible loan.\\n\\nFHA LOAN\\nA government-backed mortgage loan supported by the US FHA and the Department of Housing and Urban Development (HUD). \\n\\nFHA\\n(Federal Housing Administration). A division of the Department of Housing and Urban Development. The FHA's main activity is the insuring of residential mortgage loans made by private lenders. It sets standards for construction and underwriting. FHA neither lends money, nor plans, nor constructs housing.\\n\\nAn agency under the U.S. Department of Housing and Urban Development (HUD), it insures loans made by approved lenders to qualified borrowers, in accordance with its regulations.\\n\\nFNMA LOAN\\nThe Federal National Mortgage Association is a congressionally chartered, shareholder-owned company. This organization is the nation's largest supplier of home mortgage funds.\\n\\nFIXED RATE MORTGAGE\\nWith fixed rate mortgage (FRM) loan the interest rate and your mortgage monthly payments remain fixed for the period of the loan. Fixed-rate mortgages are available for 30, 25, 20, 15 years and 10 years. Generally, the shorter the term of a loan, the lower the interest rate you could get.\\n\\nThe most popular mortgage terms are 30 and 15 years. With the traditional 30-year fixed rate mortgage your monthly payments are lower than they would be on a shorter term loan. But if you can afford higher monthly payments a 15-year fixed-rate mortgage allows you to repay your loan twice as faster and save more than half the total interest costs of a 30-year loan.\\n\\nThe payments on fixed rate fully amortizing loans are calculated so that at the end of the term the mortgage loan is paid in full. During the early amortization period, a large percentage of the monthly payment is used for paying the interest. As the loan is paid down, more of the monthly payment is applied to principal.\\n\\nWith biweekly mortgage plan you pay half of the monthly mortgage payment every 2 weeks. It allows you to repay a loan much faster. For example, a 30 year loan can be paid off within 18 to 19 years.\\n\\nFIXED RATE ARM\\nWith fixed-period ARMs homeowners can enjoy from three to ten years of fixed payments before the initial interest rate change. At the end of the fixed period, the interest rate will adjust annually. Fixed-period ARMs -- 30/3/1, 30/5/1, 30/7/1 and 30/10/1 -- are generally tied to the one-year Treasury securities index. ARMs with an initial fixed period beside of lifetime and adjustment caps usually have also first adjustment cap. It limits the interest rate you will pay the first time your rate is adjusted. First adjustment caps vary with type of loan program.\\n\\nGOVERNMENT LOAN\\nThe Federal Housing Administration (FHA), which is part of the U.S. Dept. of Housing and Urban Development (HUD), administers various mortgage loan programs. FHA loans have lower down payment requirements and are easier to qualify than conventional loans. FHA loans cannot exceed the statutory limit.\\n\\nGRADUATED PAYMENT MORTGAGE (GPM)\\nGraduated payment mortgages have payments that start low and gradually increase at predetermined times. A lower initial payments allow you to qualify for a larger loan amount. The monthly payments will eventually be higher in order to catch up from the lower payments. In fact, your loan will be negatively amortizing during the early years of the loan, then pay off the principal at an accelerated pace through the later years.\\n\\nLenders offer different GPM payment plans, which vary in the rate of payment increases and the number of years over which the payments will increase. The greater the rate of increase or the longer the period of increase, the lower the mortgage payments in the early years.\\n\\nJUMBO LOAN \\nLoans above the maximum loan amount established by Fannie Mae and Freddie Mac are known as 'jumbo' loans. Because jumbo loans are bought and sold on a much smaller scale, they often have a little higher interest rate than conforming, but the spread between the two varies with the economy.\\n\\nNEGATIVE AMORTIZING LOAN\\nSome types of ARMs offer payment caps rather than interest rate caps, which limit the amount the monthly payment can increase. If a loan has a payment cap but has no periodic interest rate cap, then the loan may become negatively amortized: if the interest rates rise to the point that the monthly mortgage payment does not cover the interest due, any unpaid interest will get added to the loan balance, so the loan balance increases. However, you always have the option to pay the minimum monthly payment, or the fully amortized amount due.\\n\\nThe advantage of negatively amortizing loans is that you can control cash flow (relatively stable payment), take advantage of low interest rates relative to the market at any given time, and pay back the money borrowed today at a depreciated value years from now (because of natural inflation). This makes such loans a great tool for homeowners as long as you understand the mechanics of what's going on.\\n\\nWith most ARMs, the interest rate can adjust every six months, once a year, every three years, or every five years. The interest rate on negatively amortized loans can adjust monthly. A loan with an adjustment period of 6 months is called a 6-month ARM, with an adjustment period of 1 year is called a 1-year ARM, and so on. Most ARMs offer an initial lower interest rate than the fully indexed rate (index plus margin) during the initial period of the loan, which could be one month or a year or more. It is also known as teaser rate.\\n\\nAll ARMs are available with 30-year terms and some with 15-year terms.\\n\\nAdjustable rate mortgages generally have a lower initial interest rate than fixed rate loans.\\n\\nTWO-STEP MORTGAGE\\nTwo-Step mortgages have a fixed rate for a certain time, most often 5 or 7 years, and then interest rate changes to a current market rate. After that adjustment the mortgage maintains new fixed rate for the remaining 23 or 25 years.\\n\\nRHS LOAN\\nThe Rural Housing Authority.\\n\\nVA LOAN\\nVA loans are guaranteed by U.S. Dept. of Veterans Affairs. The guaranty allows veterans and service persons to obtain home loans with favorable loan terms, usually without a down payment. In addition, it is easier to qualify for a VA loan than a conventional loan. Lenders generally limit the maximum VA loan to $203,000. The U.S. Department of Veterans Affairs does not make loans, it guarantees loans made by lenders. VA determines your eligibility and, if you are qualified, VA will issue you a certificate of eligibility to be used in applying for a VA loan. VA-guaranteed loans are obtained by making application to private lending institutions.\",\"primaryKey\":[\"MortgageLoanTypeId\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"MortgageLoanType.cdm.json/MortgageLoanType\",\"name\":\"MortgageLoanTypeId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a Mortgage Loan Type.\",\"isNullable\":false,\"name\":\"MortgageLoanTypeId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"MortgageLoanType.cdm.json/MortgageLoanType\",\"name\":\"MortgageLoanTypeName\"},\"dataType\":\"string\",\"dataTypeLength\":256,\"description\":\"The name of a Mortgage Loan Type.\",\"isNullable\":true,\"name\":\"MortgageLoanTypeName\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"MortgageLoanType.cdm.json/MortgageLoanType\",\"name\":\"MortgageLoanTypeDescription\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"The description of a Mortgage Loan Type.\",\"isNullable\":true,\"name\":\"MortgageLoanTypeDescription\"}]}}}",
			"Description": "The type of mortgage loan.\n\nEx:\n- Adjustable Rate Mortgage (ARM) Loan\n- Assumed Mortgage Loan\n- Balloon Loan\n- Buydown Mortgage Loan\n- Conventional Loan\n  - Conforming\n  - Non-Conforming\n- Convertible ARM Loan\n- FHA Loan\n- FNMA Loan\n- Fixed Rate Mortgage Loan\n- Fixed Rate ARM\n- Government Loan\n- Graduated Payment Mortgage (GPM) Loan\n- Jumbo Loan\n- Negative Amortizing Loan\n- RHS Loan\n- Two-Step Mortgage Loan\n- VA Loan\n\nWhere:\n\nADJUSTABLE RATE MORTGAGE (ARM)\nVariable or adjustable loans are loans whose interest rate, and accordingly monthly payments, fluctuate over the period of the loan. With this type of mortgage, periodic adjustments based on changes in a defined index are made to the interest rate. The index for your particular loan is established at the time of application.\n\nThe margin is fixed percentage points added to the index to compute the interest rate. The margins remain fixed for the term of the loan and are not impacted by the financial markets and movement of interest rates. Lenders use a variety of margins depending upon the loan program and adjustment periods.\n\nMost ARMs have an interest rate cap to protect you from enormous increases in monthly payments. A lifetime cap limits the interest rate increase over the life of the loan. A periodic or adjustment cap limits how much your interest rate can rise at one time. Your mortgage disclosure will tell you the exact index, to be used, whether the weekly or monthly value applies, the lead time for your index, the margin, and any caps.\n\nASSUMED MORTGAGE\nIn an assumed mortgage the buyer of a real estate property is transferred all the obligations of the seller's mortgage and the buyer assumes all the obligations under the mortgage as though the loan had been made to the buyer.\n\nBALLOON LOAN\nBalloon loans are short-term fixed rate loans that have fixed monthly payments based usually upon a 30-year fully amortizing schedule and a lump sum payment at the end of its term. Usually they have terms of 3, 5, and 7 years.\n\nThe advantage of this type of loan is that the interest rate on balloon loans is generally lower than 30- and 15- year mortgages resulting in lower monthly payments. The disadvantage is that at the end of the term you will have to come up with a lump sum to pay off your lender, either through a refinance or from your own savings.\n\nBalloon loans with refinancing option allow borrowers to convert the mortgage at the end of the balloon period to a fixed rate loan -- based upon the outstanding principal balance -- if certain conditions are met. If you refinance the loan at maturity you need not be requalified, nor the property reapproved. The interest rate on the new loan is a current rate at the time of conversion. There might be a minimal processing fee to obtain the new loan. The most popular terms are 5/25 Balloon, and 7/23 Balloon. \n\nBUYDOWN MORTGAGE\nA temporary buydown is the type of loan with an initially discounted interest rate which gradually increases to an agreed-upon fixed rate usually within one to three years. An initially discounted rate allows you to qualify for more house with the same income and gives you the advantage of lower initial monthly payments for the first years of the loan when extra money may be needed for furnishings or home improvements. To reduce your monthly payments during the first few years of a mortgage you make an initial lump sum payment to the lender. If you do not have the cash to pay for the buydown, the lender can pay this fee if you agree on a little higher interest rate. The lower rate may apply for the full duration of the loan or for just the first few years. A buydown may be used to qualify a borrower who would otherwise not qualify . This is because a buydown results in lower payments which are easier to qualify for.\n\nCONVENTIONAL LOAN\n- Conforming\n- Non-Conforming\n\nAny mortgage loan other than an FHA, VA or an RHS loan is a conventional one.\n\nConventional loans may be conforming and non-conforming. Conforming loans have terms and conditions that follow the guidelines set forth by Fannie Mae and Freddie Mac. These two stockholder-owned corporations purchase mortgage loans complying with the guidelines from mortgage lending institutions, packages the mortgages into securities and sell the securities to investors. By doing so, Fannie Mae and Freddie Mac, like Ginnie Mae, provide a continuous flow of affordable funds for home financing that results in the availability of mortgage credit for Americans. Fannie Mae and Freddie Mac guidelines establish the maximum loan amount, borrower credit and income requirements, down payment, and suitable properties. Fannie Mae and Freddie Mac announces new loan limits every year.\n\nCONVERTIBLE ARM\nSome ARMs come with option to convert them to a fixed-rate mortgage at designated times (usually during the first five years on the adjustment date), if you see interest rates starting to rise. The new rate is established at the current market rate for fixed-rate mortgages.\n\nThe conversion is typically done for a nominal fee and requires almost no paperwork. The disadvantage is that the conversion interest rate is typically a little higher than the market rate at that time.\n\nThe other kind of convertible mortgage is a fixed rate loan with rate reduction option. If rates had dropped since the time of closing it allows you, under some prescribed conditions, for a small conversion fee to adjust your mortgage to going market rate. Generally the interest rate or discount points may be a little higher for a convertible loan.\n\nFHA LOAN\nA government-backed mortgage loan supported by the US FHA and the Department of Housing and Urban Development (HUD). \n\nFHA\n(Federal Housing Administration). A division of the Department of Housing and Urban Development. The FHA's main activity is the insuring of residential mortgage loans made by private lenders. It sets standards for construction and underwriting. FHA neither lends money, nor plans, nor constructs housing.\n\nAn agency under the U.S. Department of Housing and Urban Development (HUD), it insures loans made by approved lenders to qualified borrowers, in accordance with its regulations.\n\nFNMA LOAN\nThe Federal National Mortgage Association is a congressionally chartered, shareholder-owned company. This organization is the nation's largest supplier of home mortgage funds.\n\nFIXED RATE MORTGAGE\nWith fixed rate mortgage (FRM) loan the interest rate and your mortgage monthly payments remain fixed for the period of the loan. Fixed-rate mortgages are available for 30, 25, 20, 15 years and 10 years. Generally, the shorter the term of a loan, the lower the interest rate you could get.\n\nThe most popular mortgage terms are 30 and 15 years. With the traditional 30-year fixed rate mortgage your monthly payments are lower than they would be on a shorter term loan. But if you can afford higher monthly payments a 15-year fixed-rate mortgage allows you to repay your loan twice as faster and save more than half the total interest costs of a 30-year loan.\n\nThe payments on fixed rate fully amortizing loans are calculated so that at the end of the term the mortgage loan is paid in full. During the early amortization period, a large percentage of the monthly payment is used for paying the interest. As the loan is paid down, more of the monthly payment is applied to principal.\n\nWith biweekly mortgage plan you pay half of the monthly mortgage payment every 2 weeks. It allows you to repay a loan much faster. For example, a 30 year loan can be paid off within 18 to 19 years.\n\nFIXED RATE ARM\nWith fixed-period ARMs homeowners can enjoy from three to ten years of fixed payments before the initial interest rate change. At the end of the fixed period, the interest rate will adjust annually. Fixed-period ARMs -- 30/3/1, 30/5/1, 30/7/1 and 30/10/1 -- are generally tied to the one-year Treasury securities index. ARMs with an initial fixed period beside of lifetime and adjustment caps usually have also first adjustment cap. It limits the interest rate you will pay the first time your rate is adjusted. First adjustment caps vary with type of loan program.\n\nGOVERNMENT LOAN\nThe Federal Housing Administration (FHA), which is part of the U.S. Dept. of Housing and Urban Development (HUD), administers various mortgage loan programs. FHA loans have lower down payment requirements and are easier to qualify than conventional loans. FHA loans cannot exceed the statutory limit.\n\nGRADUATED PAYMENT MORTGAGE (GPM)\nGraduated payment mortgages have payments that start low and gradually increase at predetermined times. A lower initial payments allow you to qualify for a larger loan amount. The monthly payments will eventually be higher in order to catch up from the lower payments. In fact, your loan will be negatively amortizing during the early years of the loan, then pay off the principal at an accelerated pace through the later years.\n\nLenders offer different GPM payment plans, which vary in the rate of payment increases and the number of years over which the payments will increase. The greater the rate of increase or the longer the period of increase, the lower the mortgage payments in the early years.\n\nJUMBO LOAN \nLoans above the maximum loan amount established by Fannie Mae and Freddie Mac are known as 'jumbo' loans. Because jumbo loans are bought and sold on a much smaller scale, they often have a little higher interest rate than conforming, but the spread between the two varies with the economy.\n\nNEGATIVE AMORTIZING LOAN\nSome types of ARMs offer payment caps rather than interest rate caps, which limit the amount the monthly payment can increase. If a loan has a payment cap but has no periodic interest rate cap, then the loan may become negatively amortized: if the interest rates rise to the point that the monthly mortgage payment does not cover the interest due, any unpaid interest will get added to the loan balance, so the loan balance increases. However, you always have the option to pay the minimum monthly payment, or the fully amortized amount due.\n\nThe advantage of negatively amortizing loans is that you can control cash flow (relatively stable payment), take advantage of low interest rates relative to the market at any given time, and pay back the money borrowed today at a depreciated value years from now (because of natural inflation). This makes such loans a great tool for homeowners as long as you understand the mechanics of what's going on.\n\nWith most ARMs, the interest rate can adjust every six months, once a year, every three years, or every five years. The interest rate on negatively amortized loans can adjust monthly. A loan with an adjustment period of 6 months is called a 6-month ARM, with an adjustment period of 1 year is called a 1-year ARM, and so on. Most ARMs offer an initial lower interest rate than the fully indexed rate (index plus margin) during the initial period of the loan, which could be one month or a year or more. It is also known as teaser rate.\n\nAll ARMs are available with 30-year terms and some with 15-year terms.\n\nAdjustable rate mortgages generally have a lower initial interest rate than fixed rate loans.\n\nTWO-STEP MORTGAGE\nTwo-Step mortgages have a fixed rate for a certain time, most often 5 or 7 years, and then interest rate changes to a current market rate. After that adjustment the mortgage maintains new fixed rate for the remaining 23 or 25 years.\n\nRHS LOAN\nThe Rural Housing Authority.\n\nVA LOAN\nVA loans are guaranteed by U.S. Dept. of Veterans Affairs. The guaranty allows veterans and service persons to obtain home loans with favorable loan terms, usually without a down payment. In addition, it is easier to qualify for a VA loan than a conventional loan. Lenders generally limit the maximum VA loan to $203,000. The U.S. Department of Veterans Affairs does not make loans, it guarantees loans made by lenders. VA determines your eligibility and, if you are qualified, VA will issue you a certificate of eligibility to be used in applying for a VA loan. VA-guaranteed loans are obtained by making application to private lending institutions.",
			"DisplayFolderInfo": "{\"name\":\"Product\",\"colorCode\":\"#0E3D73\"}",
			"PrimaryKeys": "MortgageLoanTypeId",
			"spark.sql.sources.provider": "csv",
			"sql:IsAppendOnly": false
		},
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false
	},
	"type": "TABLE"
}